{
    "9230416703.jpg": {
        "caption": "The image shows a group of people standing on a road, with their bicycles parked nearby. They are likely taking a break from their biking activities.",
        "label": 4
    },
    "28576502574.jpg": {
        "caption": "The image shows a man wearing a backpack and shorts, jumping or leaping off a rock or a small hill. He appears to be enjoying the outdoor activity and is captured in mid-air.",
        "label": 4
    },
    "16893207921.jpg": {
        "caption": "The image shows a man standing on a snow-covered ground, wearing a black jacket and a hat. He is giving a thumbs-up sign, indicating his approval or enjoyment of the snowy environment.",
        "label": 4
    },
    "21577151134.jpg": {
        "caption": "The image shows a woman wearing a blue shirt and sunglasses, skiing down a snowy slope. She is also wearing a backpack.",
        "label": 4
    },
    "snev_NA_1529_52699245055__b.jpg": {
        "caption": "The image shows a group of people riding bicycles down a muddy path or trail.",
        "label": 4
    },
    "7526466488.jpg": {
        "caption": "The image shows a group of people standing on a rocky hill, with their shadows cast on the ground.",
        "label": 4
    },
    "guadarrama_NA_1855_27591532511__b.jpg": {
        "caption": "The image shows a man playing golf on a lush green course. He is in the process of swinging his golf club, aiming to hit the golf ball.",
        "label": 4
    },
    "guadarrama_NA_1265_16671961223__b.jpg": {
        "caption": "The image shows a woman riding a skateboard, possibly performing a trick or maneuver. She is wearing a helmet for safety while skateboarding.",
        "label": 4
    },
    "15290268886.jpg": {
        "caption": "The image shows a bicycle parked on the side of a road, with a beautiful mountain range in the background.",
        "label": 4
    },
    "34003840640.jpg": {
        "caption": "The image shows a group of people walking along a narrow path, possibly a riverbed or a rocky canyon. They are carrying backpacks and appear to be hikers or travelers.",
        "label": 4
    },
    "5456351224.jpg": {
        "caption": "The image shows a man and a woman walking together, with the woman carrying a backpack. They are walking near a body of water, possibly a lake or a river.",
        "label": 4
    },
    "29936549254.jpg": {
        "caption": "The image shows a man wearing a helmet and glasses, sitting on a chair at a ski resort. He is holding a cell phone in his hand.",
        "label": 4
    },
    "16133152924.jpg": {
        "caption": "The image shows a snowboarder's shadow on the snow, with the shadow of the snowboarder and the snowboard visible.",
        "label": 4
    },
    "7823905540.jpg": {
        "caption": "The image shows a large, open field with a hill in the background. The field is empty, and there are no people or animals visible in the scene.",
        "label": 4
    },
    "aiguestortes_NA_1195_50271791697__b.jpg": {
        "caption": "The image shows a group of people walking up a steep hill or mountain, carrying backpacks.",
        "label": 4
    },
    "357385115.jpg": {
        "caption": "The image shows a group of people, including a man and a woman, sitting on a bench in a room. They are wearing ski gear and appear to be taking a break from skiing.",
        "label": 4
    },
    "15506384734.jpg": {
        "caption": "The image shows a snowy landscape with a group of people skiing and snowboarding on a mountain.",
        "label": 4
    },
    "4279114426.jpg": {
        "caption": "The image shows a snowy mountain with a ski lift, a ski slope, and a ski resort. There are several people on the ski slope, enjoying the winter sports activities.",
        "label": 4
    },
    "7990475095.jpg": {
        "caption": "The image shows a man and a woman standing on a rocky hill, posing for a picture. They are both wearing backpacks, suggesting that they might be hikers or outdoor enthusiasts. The scene is set against a beautiful blue sky, which adds to the overall aesthetic of the image.",
        "label": 4
    },
    "8336574447.jpg": {
        "caption": "The image shows a man and a woman standing on a snow-covered slope, both wearing ski gear and holding their skis. They are posing for a picture, likely enjoying their time on the mountain.",
        "label": 4
    },
    "13931427847.jpg": {
        "caption": "The image shows a snowy mountain slope with a ski resort in the background. The scene is captured from the top of the slope, providing a panoramic view of the ski resort and the surrounding landscape.",
        "label": 4
    },
    "granada_989780_989780_1475776674465779717_image_FHsDB-MXEAM-kVE.jpg": {
        "caption": "The image shows a person skiing down a snow-covered slope, with another person following closely behind them. The skier in the foreground is wearing a red jacket, while the person following is wearing an orange jacket.",
        "label": 4
    },
    "5422823239.jpg": {
        "caption": "The image shows a group of people skiing down a snow-covered slope.",
        "label": 4
    },
    "guadarrama_NA_1265_16668356984__b.jpg": {
        "caption": "The image shows a man riding a skateboard, wearing a helmet, and navigating through a series of traffic cones.",
        "label": 4
    },
    "33778651610.jpg": {
        "caption": "The image shows a man standing on a rocky hill, looking out over a mountain range. He is wearing a backpack and has a pair of skis with him.",
        "label": 4
    },
    "123724921.jpg": {
        "caption": "The image shows a man sitting on a rocky outcropping or a rocky hillside, possibly on a mountain. He is wearing a backpack and appears to be enjoying the view from his elevated position.",
        "label": 4
    },
    "19037448683.jpg": {
        "caption": "The image shows a group of people walking on a road, possibly on a mountain trail. They are walking in a line, and there are trees in the background.",
        "label": 4
    },
    "20285129223.jpg": {
        "caption": "The image shows a group of people standing on top of a mountain or a large rock formation.",
        "label": 4
    },
    "8491155915.jpg": {
        "caption": "The image shows a snowboarder wearing yellow pants, sitting on a snowboard on a snow-covered slope.",
        "label": 4
    },
    "aiguestortes_NA_3370_45799349285__b.jpg": {
        "caption": "The image shows a group of people walking up a snowy mountain or hill. They are making their way up the slope, possibly for skiing or other winter activities.",
        "label": 4
    },
    "4919888811.jpg": {
        "caption": "The image shows a man wearing a helmet and sunglasses, riding a bicycle on a path. He is smiling and appears to be enjoying his ride.",
        "label": 4
    },
    "14472173930.jpg": {
        "caption": "The image shows a man wearing a backpack and standing on a hill or mountain. He is taking a picture of himself, capturing the moment with the camera.",
        "label": 4
    },
    "snev_NA_2371_53505135549__b.jpg": {
        "caption": "The image shows a group of people walking up a hill or mountain, likely engaging in a physical activity or exercise.",
        "label": 4
    },
    "aiguestortes_NA_1196_32853153568__b.jpg": {
        "caption": "The image shows a man standing on skis in a snowy area, possibly on a mountain. He is wearing a blue jacket and holding ski poles.",
        "label": 4
    },
    "aiguestortes_NA_3547_29391679506__b.jpg": {
        "caption": "The image shows a person, likely a hiker or a backpacker, standing on a rocky hillside or mountain trail. They are holding a ski pole and appear to be wearing a backpack. The scene suggests that the person is either preparing to ski down the hill or is taking a break during their hike.",
        "label": 4
    },
    "4936057896.jpg": {
        "caption": "The image shows a man riding a bicycle down a road.",
        "label": 4
    },
    "aiguestortes_NA_1273_33729607764__b.jpg": {
        "caption": "The image shows a man standing on top of a snow-covered mountain, giving a thumbs-up sign. He is wearing a blue shirt and appears to be enjoying his time in the snowy environment.",
        "label": 4
    },
    "5856334784.jpg": {
        "caption": "The image shows a man riding a bicycle on a dirt road, surrounded by a beautiful mountain landscape.",
        "label": 4
    },
    "21442525899.jpg": {
        "caption": "The image shows a person wearing a watch, likely a wristwatch, and pointing at a mountain. The person is standing on a mountain, possibly enjoying the view or taking a photograph.",
        "label": 4
    },
    "12248877834.jpg": {
        "caption": "The image shows a snowy scene with a bench and a light pole. There are also several skis and ski poles placed on the bench.",
        "label": 4
    },
    "aiguestortes_NA_1266_22348594121__b.jpg": {
        "caption": "The image shows a man and a woman walking up a mountain, carrying their backpacks. They are making their way up the steep hill, likely preparing for a hiking adventure or an outdoor activity.",
        "label": 4
    },
    "9495280825.jpg": {
        "caption": "The image shows a man holding a bicycle on top of a mountain.",
        "label": 4
    },
    "4531783470.jpg": {
        "caption": "The image shows a man standing on a snowy mountain, wearing a backpack and holding ski poles. He is posing for a picture in front of the mountain, capturing the beautiful scenery.",
        "label": 4
    },
    "aiguestortes_NA_1634_52326648263__b.jpg": {
        "caption": "The image shows a person standing in a grassy field, with mountains in the background. The person is holding a pole, possibly a ski pole, and appears to be enjoying the outdoor scenery.",
        "label": 4
    },
    "snev_NA_642_52698806466__b.jpg": {
        "caption": "The image shows a group of people standing next to their bicycles, possibly taking a break from cycling.",
        "label": 4
    },
    "16090872610.jpg": {
        "caption": "The image shows a man wearing a helmet and goggles, standing on a snowy surface. He is also wearing a backpack.",
        "label": 4
    },
    "6999243162.jpg": {
        "caption": "The image shows a bicycle parked on a grassy hillside, with a mountain in the background.",
        "label": 4
    },
    "31368456353.jpg": {
        "caption": "The image shows a snowboarder sitting on a chairlift, wearing a red hat and an orange jacket. The snowboarder is holding their snowboard while riding the chairlift.",
        "label": 4
    },
    "guadarrama_NA_1265_17083374267__b.jpg": {
        "caption": "The image shows a man riding a skateboard, navigating through a series of green cones.",
        "label": 4
    },
    "5057666164.jpg": {
        "caption": "The image shows a bicycle parked on a rocky hillside, with a backpack and a water bottle attached to it. The scene also includes a mountain in the background.",
        "label": 4
    },
    "32713756964.jpg": {
        "caption": "The image shows a person walking up a snowy hill or mountain, with their footprints visible in the snow.",
        "label": 4
    },
    "1662137160.jpg": {
        "caption": "The image shows a man sitting on a rocky hillside, surrounded by a mountainous landscape. He is wearing a backpack and has a dog lying next to him.",
        "label": 4
    },
    "16965159129.jpg": {
        "caption": "The image shows a ski slope with a ski lodge in the background. There are several people skiing on the slope, and some are standing on the snow-covered ground. The scene also includes a ski lift and a ski lodge, which adds to the winter sports atmosphere.",
        "label": 4
    },
    "10121105795.jpg": {
        "caption": "The image shows a woman standing on a cliff or mountain top, overlooking a valley below. She is wearing a backpack and appears to be enjoying the breathtaking view.",
        "label": 4
    },
    "13673460293.jpg": {
        "caption": "The image shows a woman wearing a helmet and goggles, standing on a ski lift. She is smiling and appears to be enjoying her time on the ski lift.",
        "label": 4
    },
    "3073534171.jpg": {
        "caption": "The image shows a group of people enjoying themselves in a river, with some of them riding in a raft.",
        "label": 4
    },
    "9607646931.jpg": {
        "caption": "The image shows a snowy mountain with a large group of people skiing and snowboarding down the slope.",
        "label": 4
    },
    "7826092770.jpg": {
        "caption": "The image shows a group of people walking up a hill or mountain, possibly on a road or a trail. They are carrying backpacks, and the scene appears to be set in a mountainous area.",
        "label": 4
    },
    "12289634865.jpg": {
        "caption": "The image shows a large group of people gathered on a snow-covered slope, likely at a ski resort. They are standing in line, possibly waiting for a ski lift or preparing to ski down the mountain.",
        "label": 4
    },
    "16173052383.jpg": {
        "caption": "The image shows a man and a woman standing on a snow-covered slope, with the man kneeling down to the woman. They are both wearing backpacks, and the woman is holding the man's hand. The scene appears to be a romantic moment or a gesture of affection between the two individuals.",
        "label": 4
    },
    "guadarrama_NA_1265_17090565157__b.jpg": {
        "caption": "The image shows a young man performing a skateboard trick, jumping into the air while riding the skateboard.",
        "label": 4
    },
    "peneda_1_343086_1029791430754136064_image_DkqN15bW0AAFu8E.jpg": {
        "caption": "The image shows a man riding a jet ski on a body of water, specifically a lake.",
        "label": 4
    },
    "8336571321.jpg": {
        "caption": "The image shows a group of four people standing on a snow-covered slope, posing for a picture. They are all wearing backpacks and appear to be enjoying their time in the snowy environment.",
        "label": 4
    },
    "19781661380.jpg": {
        "caption": "The image shows a group of people standing on a rocky hillside or cliff, possibly near a mountain. They are posing for a picture, and some of them are wearing backpacks.",
        "label": 4
    },
    "2255016304.jpg": {
        "caption": "The image shows a ski slope with a ski lift, which is carrying skiers up the mountain. The ski lift is full of people, and the sun is shining brightly, creating a beautiful and lively atmosphere.",
        "label": 4
    },
    "9498075552.jpg": {
        "caption": "The image shows a man riding a bicycle on a road, with a mountain in the background.",
        "label": 4
    },
    "2260481515.jpg": {
        "caption": "The image shows a man skiing down a snow-covered slope, wearing a black jacket and goggles. He is skiing on a wire, which adds an element of excitement and challenge to his skiing experience.",
        "label": 4
    },
    "4521011659.jpg": {
        "caption": "The image shows a person riding a bicycle and performing a jump or a trick in the air.",
        "label": 4
    },
    "3220154765.jpg": {
        "caption": "The image shows a group of people sitting on a hillside, with a mountain in the background. They are wearing backpacks and appear to be taking a break from their outdoor adventure.",
        "label": 4
    },
    "snev_NA_1125_52825563015__b.jpg": {
        "caption": "The image shows a group of people, including both men and women, standing on a rocky cliff or hillside. They are wearing backpacks and appear to be hikers or outdoor enthusiasts.",
        "label": 4
    },
    "6504104495.jpg": {
        "caption": "The image shows a person, likely a woman, skiing down a snow-covered slope. She is wearing a black jacket and is holding ski poles while skiing.",
        "label": 4
    },
    "33419070042.jpg": {
        "caption": "The image shows a group of people standing on a rocky hillside or mountain, with snow visible in the background.",
        "label": 4
    },
    "19035985034.jpg": {
        "caption": "The image shows a man wearing a hat and a backpack, standing on a rocky hillside or mountain. He appears to be looking at the ground or possibly at a rock.",
        "label": 4
    },
    "guadarrama_NA_1346_17307561042__b.jpg": {
        "caption": "The image shows a man riding a skateboard down a street.",
        "label": 4
    },
    "26771374906.jpg": {
        "caption": "The image shows a group of people, including a man on a bicycle, standing on a mountain or hillside. They are posing for a picture, possibly enjoying a break from their cycling adventure.",
        "label": 4
    },
    "snev_NA_1612_52825164661__b.jpg": {
        "caption": "The image shows a group of people walking up a hill or mountain, carrying backpacks and wearing pink shirts. They are likely hikers or trekkers enjoying the outdoors and engaging in physical activity.",
        "label": 4
    },
    "12288056533.jpg": {
        "caption": "The image shows a man wearing a blue hat and sunglasses, sitting in front of a picture of a snowy mountain.",
        "label": 4
    },
    "12286735546.jpg": {
        "caption": "The image shows a group of people skiing down a snowy mountain slope.",
        "label": 4
    },
    "guadarrama_NA_1855_27591494951__b.jpg": {
        "caption": "The image shows a man playing golf on a lush green course. He is holding a golf club and preparing to hit the ball.",
        "label": 4
    },
    "8253686521.jpg": {
        "caption": "The image shows a group of people skiing and snowboarding on a snow-covered slope.",
        "label": 4
    },
    "5362857827.jpg": {
        "caption": "The image shows a group of people skiing down a snowy slope.",
        "label": 4
    },
    "13968210960.jpg": {
        "caption": "The image shows a man standing on a snow-covered slope, wearing a backpack and a helmet. He is posing for a picture in front of a large satellite dish or a large antenna.",
        "label": 4
    },
    "12194437274.jpg": {
        "caption": "The image shows a ski lift with a ski lift chair, which is carrying skiers up the mountain.",
        "label": 4
    },
    "67876987.jpg": {
        "caption": "The image shows a man wearing a backpack and standing on a rocky hillside or mountain. He is smiling and appears to be enjoying his outdoor adventure.",
        "label": 4
    },
    "aiguestortes_NA_325_19417893170__o.jpg": {
        "caption": "The image shows a group of people, including hikers and skiers, standing on a mountain with their backpacks and skiing gear. They are likely taking a break or preparing for their next adventure.",
        "label": 4
    },
    "aiguestortes_NA_2807_29425502625__b.jpg": {
        "caption": "The image shows a person, likely a hiker, walking up a steep hill or mountain trail. The person is carrying a backpack, and there is a water bottle visible in the scene. The trail appears to be rocky and challenging, as the hiker navigates the steep incline.",
        "label": 4
    },
    "9415379210.jpg": {
        "caption": "The image shows a person standing on a rocky mountain, overlooking a valley below. The person is wearing a backpack and appears to be enjoying the breathtaking view.",
        "label": 4
    },
    "3048550650.jpg": {
        "caption": "The image shows a ski lift with two people riding in it. The ski lift is carrying the people up the mountain, providing them with an opportunity to ski down the slopes.",
        "label": 4
    },
    "aiguestortes_NA_1201_52395819360__b.jpg": {
        "caption": "The image shows a group of people, including a man and a woman, sitting on a rocky hillside with their backpacks. They are likely taking a break from their outdoor adventure or hiking activity.",
        "label": 4
    },
    "aiguestortes_NA_4459_17269616348__b.jpg": {
        "caption": "The image shows a group of people, including children, wearing life jackets and riding in a raft or canoe. They are paddling together, enjoying their time on the water.",
        "label": 4
    },
    "13697720435.jpg": {
        "caption": "The image shows a woman wearing a red jacket and white pants, standing on a snow-covered slope. She is smiling and appears to be enjoying her time on the ski slope.",
        "label": 4
    },
    "13697374973.jpg": {
        "caption": "The image shows a display of snowboards, with two snowboards hanging on a wall.",
        "label": 4
    },
    "17127923330.jpg": {
        "caption": "The image shows a man standing next to a sign, which is likely a street sign or a sign indicating a specific location. The man is wearing sunglasses and appears to be enjoying his time outdoors.",
        "label": 4
    },
    "13968180107.jpg": {
        "caption": "The image shows a man wearing sunglasses and a black jacket, sitting on a ski lift. He is looking down at the snow below him.",
        "label": 4
    },
    "20177672363.jpg": {
        "caption": "The image shows a group of people walking up a snowy hill or mountain. They are carrying backpacks and appear to be hikers or trekkers.",
        "label": 4
    },
    "18805801745.jpg": {
        "caption": "The image shows a person climbing a rocky hill or mountain, possibly a rock climber or a hiker.",
        "label": 4
    },
    "6305005523.jpg": {
        "caption": "The image shows a person walking on a trail in a mountainous area, with a mountain in the background.",
        "label": 4
    },
    "7263520580.jpg": {
        "caption": "The image shows a snowy hill with two people walking up the slope. One person is carrying a backpack, and both individuals are wearing skis.",
        "label": 4
    },
    "32674816093.jpg": {
        "caption": "The image shows a collection of snowboards, with some of them being upside down. The snowboards are lined up, and they are displayed in a way that makes it easy for people to see and choose the one they want to use.",
        "label": 4
    },
    "guadarrama_NA_1855_27630768116__b.jpg": {
        "caption": "The image shows a man playing golf on a lush green course. He is in the process of putting the golf ball into the hole.",
        "label": 4
    },
    "aiguestortes_NA_4459_17269608558__b.jpg": {
        "caption": "The image shows a man wearing a helmet and a life jacket, paddling a kayak in a river. He is holding a paddle and appears to be enjoying his time on the water.",
        "label": 4
    },
    "5381834791.jpg": {
        "caption": "The image shows a person standing on a snow-covered mountain, wearing a backpack and holding a ski pole. The person is also wearing a hat, which is a common accessory for outdoor activities in cold weather conditions.",
        "label": 4
    },
    "9007850349.jpg": {
        "caption": "The image shows a person, likely a woman, skiing down a snow-covered slope. The skier is wearing a backpack and is skiing on a snowy mountain.",
        "label": 4
    },
    "aiguestortes_NA_4459_17522660232__b.jpg": {
        "caption": "The image shows two men in kayaks, paddling down a river.",
        "label": 4
    },
    "15575194534.jpg": {
        "caption": "The image shows a snowy ski slope with several people skiing and snowboarding. There are also a couple of snowboarders sitting on the slope, and a snowboarder sitting on the slope with a snowboard attached to his feet.",
        "label": 4
    },
    "17590266054.jpg": {
        "caption": "The image shows a woman standing on a snow-covered slope, holding a snowball in her hand. She is wearing a backpack and appears to be enjoying her time in the snowy environment.",
        "label": 4
    },
    "12858562793.jpg": {
        "caption": "The image shows a woman standing in the snow, wearing a purple jacket and a hat. She is posing for a picture, and there are other people in the background.",
        "label": 4
    },
    "11451157766.jpg": {
        "caption": "The image shows a row of paddle boats or kayaks lined up on a snowy surface.",
        "label": 4
    },
    "5508732814.jpg": {
        "caption": "The image shows a ski slope with ski lifts and skiers on the snow-covered hill.",
        "label": 4
    },
    "7599087722.jpg": {
        "caption": "The image shows a group of people riding bicycles on a road, with a beautiful mountain range in the background.",
        "label": 4
    },
    "17247977994.jpg": {
        "caption": "The image shows a man walking up a hill or a steep incline, possibly on a dirt hillside or a rocky hill. He is wearing a backpack and appears to be hiking or climbing the hill.",
        "label": 4
    },
    "5304135095.jpg": {
        "caption": "The image shows a group of people standing on a snow-covered slope, with their skis and poles. They are posing for a picture, likely enjoying a skiing trip together.",
        "label": 4
    },
    "aiguestortes_NA_3368_33138935343__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with snow-covered mountains and a valley below. The scene is captured from a higher vantage point, providing a stunning view of the mountain range.",
        "label": 3
    },
    "6399967031.jpg": {
        "caption": "The image shows a large body of water, possibly a lake or a river, with a mountain in the background. The water appears to be calm and serene, reflecting the surrounding landscape.",
        "label": 3
    },
    "17676355311.jpg": {
        "caption": "The image shows a serene scene of a lake surrounded by trees and bushes. The water appears to be calm and reflective, creating a peaceful atmosphere.",
        "label": 3
    },
    "6120594033.jpg": {
        "caption": "The image shows a mountainous area with a rocky terrain and a grassy field. The scene is set against a blue sky, and the mountain is visible in the background.",
        "label": 3
    },
    "aiguestortes_NA_3980_29029839511__b.jpg": {
        "caption": "The image shows a beautiful mountain lake, surrounded by lush green trees and mountains. The lake is situated in a valley, and the view is captured from a higher elevation.",
        "label": 3
    },
    "5515379764.jpg": {
        "caption": "The image shows a snowy mountain landscape with a mountain range in the background. The scene is captured in a panoramic view, providing a wide perspective of the mountainous terrain.",
        "label": 3
    },
    "aiguestortes_NA_3389_52221781864__b.jpg": {
        "caption": "The image shows a serene scene of a lake with a rock sitting on top of it. The rock is reflecting the sunlight, creating a beautiful and peaceful atmosphere.",
        "label": 3
    },
    "aiguestortes_NA_1050_50271790722__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a lush green forest surrounding the mountain. The forest is filled with trees, and the mountain is visible in the background. The scene is serene and picturesque, showcasing the natural beauty of the area.",
        "label": 3
    },
    "33209378483.jpg": {
        "caption": "The image shows a snowy mountain with a road running through it. The road is surrounded by snow, and there are people walking along it. The scene also includes a mountain pass and a mountainous area with a cloudy sky.",
        "label": 3
    },
    "20970019044.jpg": {
        "caption": "The image shows a mountainous landscape with a large mountain in the background. The scene is set against a blue sky, and the mountain appears to be a part of a mountain range.",
        "label": 3
    },
    "8513250557.jpg": {
        "caption": "The image shows a road running through a desert landscape, with a row of trees lining the road on both sides. The road appears to be empty, and the sky is blue, creating a serene atmosphere.",
        "label": 3
    },
    "15833799008.jpg": {
        "caption": "The image shows a snowy mountain landscape with a tree in the foreground. The tree is bare, and the mountain range is visible in the background.",
        "label": 3
    },
    "13032859175.jpg": {
        "caption": "The image shows a snowy landscape with a tree in the foreground. The tree is surrounded by snow, and there is a mountain in the background. The scene appears to be a winter landscape, with the tree and the mountain covered in snow.",
        "label": 3
    },
    "4318183411.jpg": {
        "caption": "The image shows a snowy mountain peak, with a beautiful view of the sunset in the background.",
        "label": 3
    },
    "8508711761.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a snow-covered mountain and a blue sky. The mountain is covered in snow, and the sky is clear and blue.",
        "label": 3
    },
    "aiguestortes_NA_3321_50404325866__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a lush green hillside, a forest of trees, and a mountain peak. The scene is set against a blue sky, creating a serene and picturesque atmosphere.",
        "label": 3
    },
    "aiguestortes_NA_3691_21804600352__b.jpg": {
        "caption": "The image shows a beautiful mountain lake, with a reflection of the mountain in the water. The scene is serene and picturesque, with the mountain's shadow cast on the water.",
        "label": 3
    },
    "10192830644.jpg": {
        "caption": "The image shows a mountainous landscape with a large mountain range, a valley, and a rocky cliff. The scene is set against a backdrop of a bright sky.",
        "label": 3
    },
    "13412633863.jpg": {
        "caption": "The image shows a large, cloud-like structure in the sky, possibly a cloud or a cloud formation.",
        "label": 3
    },
    "snev_NA_1029_53552163740__b.jpg": {
        "caption": "The image shows a beautiful sunset over a mountain range, with a field of yellow flowers in the foreground. The sun is setting behind the mountains, creating a picturesque scene.",
        "label": 3
    },
    "14573118620.jpg": {
        "caption": "The image shows a forest path surrounded by trees, with a dirt road leading through the woods. The path is shaded by the trees, creating a serene and peaceful atmosphere.",
        "label": 3
    },
    "10903285914.jpg": {
        "caption": "The image shows a beautiful sunset over a mountain range, with the sun setting behind the mountains. The scene is captured from a vantage point, possibly from a hill or a mountain top. The sun's rays are shining through the trees, creating a serene and picturesque atmosphere.",
        "label": 3
    },
    "6983492674.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a mountain range in the background. The scene is set against a clear blue sky, and the mountain range appears to be covered in greenery.",
        "label": 3
    },
    "aiguestortes_NA_2567_37100314550__b.jpg": {
        "caption": "The image shows a person standing on a mountain, with a beautiful view of the surrounding landscape.",
        "label": 3
    },
    "aiguestortes_NA_3368_31468213741__b.jpg": {
        "caption": "The image shows a dog standing on a hill or mountain, overlooking a valley below. The dog appears to be enjoying the view and the open space.",
        "label": 3
    },
    "aiguestortes_NA_1416_50421461376__b.jpg": {
        "caption": "The image shows a waterfall, with a large body of water cascading down a rocky cliff. The waterfall is surrounded by lush greenery, creating a picturesque scene.",
        "label": 3
    },
    "4908788040.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a clear blue sky above. The mountain is covered with trees, and the sky is filled with clouds. The scene is serene and picturesque, showcasing the natural beauty of the mountain and its surroundings.",
        "label": 3
    },
    "7208322434.jpg": {
        "caption": "The image shows a body of water, possibly a lake or a river, with a mountain in the background. The water appears to be murky, and there are trees surrounding the area.",
        "label": 3
    },
    "aiguestortes_NA_1634_41110610412__b.jpg": {
        "caption": "The image shows a snowy mountain landscape with a large mountain in the background. The scene also includes a rocky area, a valley, and a mountain range.",
        "label": 3
    },
    "32713864094.jpg": {
        "caption": "The image shows a cave with a small opening, which appears to be a tunnel or a passageway. The cave is located in a mountainous area, and the lighting in the image suggests that it is daytime.",
        "label": 3
    },
    "2703593478.jpg": {
        "caption": "The image shows a mountain range with snow-capped peaks, and it appears to be a cloudy day.",
        "label": 3
    },
    "9566973276.jpg": {
        "caption": "The image shows a mountainous area with a snow-covered mountain and a road running through it. The scene also includes a valley and a lake, creating a picturesque landscape.",
        "label": 3
    },
    "15648359227.jpg": {
        "caption": "The image shows a serene scene of a pond surrounded by trees, with a bridge overlooking the water. The pond appears to be a natural setting, possibly in a park or a forest.",
        "label": 3
    },
    "aiguestortes_NA_1194_22311832346__b.jpg": {
        "caption": "The image shows a beautiful blue lake surrounded by mountains. The lake is situated in a valley, and the mountains rise up behind it, creating a stunning natural landscape.",
        "label": 3
    },
    "14167873582.jpg": {
        "caption": "The image shows a beautiful mountain view with a rocky outcropping, a rocky cliff, and a rocky hillside. The scene is set against a backdrop of a sunset, adding to the picturesque quality of the landscape.",
        "label": 3
    },
    "20301914970.jpg": {
        "caption": "The image shows a beautiful sunset, with the sun setting behind a mountain range. The sky is filled with clouds, and the sun is shining through them, creating a stunning visual effect.",
        "label": 3
    },
    "8705711463.jpg": {
        "caption": "The image shows a snowy mountain with a cloudy sky above it. The mountain is covered in snow, and there is a large patch of snow on the side of the mountain.",
        "label": 3
    },
    "aiguestortes_NA_1267_37319589320__b.jpg": {
        "caption": "The image shows a beautiful blue lake with a rocky shore, surrounded by mountains. The water appears to be very clear, and there are rocks and boulders on the shore.",
        "label": 3
    },
    "26005545474.jpg": {
        "caption": "The image shows a beautiful mountain range with snow-capped peaks, as well as a clear blue sky.",
        "label": 3
    },
    "32668322635.jpg": {
        "caption": "The image shows a snowy mountain landscape, with a mountain peak and a snowy hill. The scene is set against a blue sky, and the mountain range is visible in the background.",
        "label": 3
    },
    "aiguestortes_NA_1634_50176674968__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a valley and a river flowing through it. The scene is set against a backdrop of a majestic mountain, and the valley is filled with lush greenery.",
        "label": 3
    },
    "20626070283.jpg": {
        "caption": "The image shows a night sky filled with stars, as well as a tree silhouette in the foreground.",
        "label": 3
    },
    "aiguestortes_NA_3588_31191153132__b.jpg": {
        "caption": "The image shows a beautiful, serene scene of a stream flowing through a forest. The stream is surrounded by rocks, and the forest is filled with trees. The overall atmosphere of the scene is peaceful and natural.",
        "label": 3
    },
    "21183667878.jpg": {
        "caption": "The image shows a mountainous landscape with a rocky hillside and a rocky mountain. The scene is set against a blue sky, and the mountain appears to be covered in dirt.",
        "label": 3
    },
    "aiguestortes_NA_2375_35656744093__b.jpg": {
        "caption": "The image shows a beautiful lake surrounded by mountains, with a clear blue sky above. The scene is serene and picturesque, with the lake being the main focus of the image.",
        "label": 3
    },
    "15748561004.jpg": {
        "caption": "The image shows a snowy mountain landscape with a forest of trees. The trees are covered in snow, and the mountain is covered in a layer of snow as well. The scene captures the beauty of the winter landscape.",
        "label": 3
    },
    "16309755933.jpg": {
        "caption": "The image shows a mountain with snow on it, as well as a cloudy sky.",
        "label": 3
    },
    "6065841308.jpg": {
        "caption": "The image shows a waterfall or a small waterfall, with a rocky area and a tree nearby. The waterfall is surrounded by rocks, and it appears to be a natural setting.",
        "label": 3
    },
    "6477020097.jpg": {
        "caption": "The image shows a serene scene of a forest with trees and a body of water, such as a lake or a pond. The reflection of the trees and the sky can be seen in the water, creating a visually appealing and peaceful atmosphere.",
        "label": 3
    },
    "15784226542.jpg": {
        "caption": "The image shows a snowy forest with a row of trees, creating a serene and picturesque winter scene.",
        "label": 3
    },
    "10578090995.jpg": {
        "caption": "The image shows a snowy mountain with a road running through it. The road is surrounded by snow, and there is a mountain in the background.",
        "label": 3
    },
    "8516279207.jpg": {
        "caption": "The image shows a nighttime view of a snow-covered mountain range, with the stars in the background. The scene is set against a dark sky, and the mountain range appears to be a part of a larger landscape.",
        "label": 3
    },
    "6488141837.jpg": {
        "caption": "The image shows a snowy mountain slope with a steep incline. The slope is covered in snow, and there are tracks in the snow, indicating that people have been skiing or snowboarding on this slope.",
        "label": 3
    },
    "27640951061.jpg": {
        "caption": "The image shows a snow-covered mountain with a rocky terrain. The mountain is covered in snow, and there are rocks scattered around the area.",
        "label": 3
    },
    "24458165162.jpg": {
        "caption": "The image shows a snowy mountain landscape with a clear blue sky above. The scene is a beautiful winter landscape, featuring a mountain range with snow-covered slopes.",
        "label": 3
    },
    "27476343683.jpg": {
        "caption": "The image shows a beautiful sunset over a grassy field, with a mountain in the background. The sun is setting, casting a warm glow over the landscape.",
        "label": 3
    },
    "5845827509.jpg": {
        "caption": "The image shows a close-up view of the moon, with a dark background.",
        "label": 3
    },
    "5168617623.jpg": {
        "caption": "The image shows a beautiful sunset over a mountain, with the sun setting behind the mountain.",
        "label": 3
    },
    "aiguestortes_NA_3368_31437606102__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a green field and a house situated in the valley. The scene is set against a backdrop of snow-capped mountains, creating a picturesque and serene atmosphere.",
        "label": 3
    },
    "33096158665.jpg": {
        "caption": "The image shows a snowy mountain landscape, with a mountain range and a valley below. The scene is set against a blue sky, and the mountain range is visible in the distance.",
        "label": 3
    },
    "29659160334.jpg": {
        "caption": "The image shows a snow-covered mountain with a cloudy sky above it.",
        "label": 3
    },
    "14029831379.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a large mountain in the background. The scene also includes a valley and a town, giving a sense of depth and scale to the landscape.",
        "label": 3
    },
    "snev_NA_379_53411421379__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a large mountain in the background. The scene is set in a forest, with trees surrounding the mountain. The mountain appears to be a part of a mountain range, and the overall atmosphere of the image is serene and picturesque.",
        "label": 3
    },
    "15921109103.jpg": {
        "caption": "The image shows a snowy path or trail, with a tree in the foreground. The path is covered in snow, and it appears to be a popular spot for people to walk or hike.",
        "label": 3
    },
    "6661780175.jpg": {
        "caption": "The image shows a serene mountain lake, with a reflection of the mountains in the water. The scene is set against a backdrop of mountains, creating a picturesque and peaceful atmosphere.",
        "label": 3
    },
    "aiguestortes_NA_3368_48388425617__b.jpg": {
        "caption": "The image shows a beautiful sunset over a mountain range, with the sun peeking over the mountains. The sky is filled with clouds, and the sun is setting behind the mountains, creating a stunning and serene scene.",
        "label": 3
    },
    "aiguestortes_NA_1634_46288837062__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a mountain range in the background. The sky is blue, and the scene is captured in a black and white photo.",
        "label": 3
    },
    "343792993.jpg": {
        "caption": "The image shows a beautiful mountain range with snow-capped peaks, as well as a cloudy sky. The mountain range is located in the background, and the cloudy sky is present above the mountains.",
        "label": 3
    },
    "4563550677.jpg": {
        "caption": "The image shows a mountainous area with a snow-covered mountain range. The scene also includes a forest and a rocky hillside.",
        "label": 3
    },
    "aiguestortes_NA_1342_48848685908__b.jpg": {
        "caption": "The image shows a mountainous landscape with a large mountain in the background. The scene also includes a forest with trees and a clear blue sky.",
        "label": 3
    },
    "26544448184.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a lush green hillside, a valley, and a mountain top. The scene is set against a backdrop of a cloudy sky.",
        "label": 3
    },
    "aiguestortes_NA_3372_30761746955__b.jpg": {
        "caption": "The image shows a mountainous landscape with a mountain range in the background. The scene is set against a blue sky, and the mountains are covered in fog, giving the impression of a misty mountain top.",
        "label": 3
    },
    "aiguestortes_NA_3076_48388491727__b.jpg": {
        "caption": "The image shows a beautiful sunset over a lush green hillside. The sun is setting behind the hill, casting a warm glow over the landscape.",
        "label": 3
    },
    "14484144266.jpg": {
        "caption": "The image shows a beautiful mountainous landscape with a cloudy sky. The scene is set in a valley, and the mountains are visible in the distance. The sky appears to be cloudy, adding to the overall atmosphere of the scene.",
        "label": 3
    },
    "7059804763.jpg": {
        "caption": "The image shows a mountain with a snowy peak, surrounded by a lush green valley. The sky is blue, and there are clouds in the background.",
        "label": 3
    },
    "5104680745.jpg": {
        "caption": "The image shows a waterfall, with a rocky cliff and a river flowing down the side of the cliff. The waterfall is surrounded by a forest, and there is a tree growing out of the waterfall.",
        "label": 3
    },
    "8695897222.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a green valley and a snow-covered mountain. The scene is set against a blue sky, and the valley is filled with lush greenery.",
        "label": 3
    },
    "snev_NA_3360_53004362635__b.jpg": {
        "caption": "The image shows a large, grassy field with a pond in the middle. The field is surrounded by mountains, creating a picturesque landscape.",
        "label": 3
    },
    "5520127618.jpg": {
        "caption": "The image shows a snowy mountain with a large, snow-covered rock formation. The rock formation appears to be a part of the mountain, and it is surrounded by snow.",
        "label": 3
    },
    "6320107896.jpg": {
        "caption": "The image shows a beautiful mountain view with a valley below. The scene is set against a backdrop of a cloudy sky.",
        "label": 3
    },
    "21312977873.jpg": {
        "caption": "The image shows a beautiful view of a mountain range, with a large rock prominently featured in the foreground. The scene is set against a cloudy sky, adding to the overall atmosphere of the landscape.",
        "label": 3
    },
    "8354991994.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a snow-covered mountain range. The scene is captured from a higher vantage point, providing a stunning view of the mountain range.",
        "label": 3
    },
    "aiguestortes_NA_1268_52163772554__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a large body of water, such as a lake or a pond, reflecting the surrounding mountains. The reflection of the mountains in the water creates a serene and picturesque scene.",
        "label": 3
    },
    "15396195325.jpg": {
        "caption": "The image shows a beautiful view of a mountain range, with a clear blue sky in the background. The scene is set in a valley, and the mountains are visible in the distance.",
        "label": 3
    },
    "5568914885.jpg": {
        "caption": "The image shows a snowy mountain with a ski trail carved into the snow. The trail is visible on the side of the mountain, and it appears to be a popular skiing spot.",
        "label": 3
    },
    "snev_NA_2664_52718556933__b.jpg": {
        "caption": "The image shows a winding road or highway, surrounded by mountains and forests. The road appears to be curving around the landscape, providing a picturesque view of the natural surroundings.",
        "label": 3
    },
    "6783197280.jpg": {
        "caption": "The image shows a beautiful sunset over a snow-covered mountain. The sun is setting behind the mountain, casting a warm glow on the scene.",
        "label": 3
    },
    "5416039805.jpg": {
        "caption": "The image shows a snowy landscape with a row of trees, creating a picturesque winter scene.",
        "label": 3
    },
    "14879264279.jpg": {
        "caption": "The image shows a river flowing through a valley, surrounded by trees and mountains. The river appears to be calm and serene, with a few people enjoying the view.",
        "label": 3
    },
    "11325859575.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a mountain range in the background. The scene is set against a blue sky, and the mountain range is covered in snow.",
        "label": 3
    },
    "5372534323.jpg": {
        "caption": "The image shows a snowy mountain with a lake at the bottom. The mountain is covered in snow, and there is a large body of water, possibly a lake, at the base of the mountain.",
        "label": 3
    },
    "5866646974.jpg": {
        "caption": "The image shows a serene scene of a small pond surrounded by trees and a fence. The pond is filled with water, and there is a reflection of a tree in the water. The overall atmosphere of the scene is peaceful and natural.",
        "label": 3
    },
    "14374003418.jpg": {
        "caption": "The image shows a mountainous area with a snowy mountain range, a valley, and a road running through it. The scene is captured in sepia tones, giving it a vintage appearance.",
        "label": 3
    },
    "14351085109.jpg": {
        "caption": "The image shows a snow-covered mountain with a large snow bank on its side. The mountain is surrounded by a lush green valley, and the scene is set against a blue sky.",
        "label": 3
    },
    "16688192028.jpg": {
        "caption": "The image shows a mountainous area with a winding road, a forest, and a mountain range in the background. The road is surrounded by trees and appears to be a scenic route.",
        "label": 3
    },
    "16993249722.jpg": {
        "caption": "The image shows a beautiful mountain range with snow-capped peaks, as well as a clear blue sky.",
        "label": 3
    },
    "15103341192.jpg": {
        "caption": "The image shows a mountainous area with snow-covered mountains and a cloudy sky. The scene is captured from a high vantage point, possibly from a mountain top or a nearby hill.",
        "label": 3
    },
    "30184058546.jpg": {
        "caption": "The image shows a beautiful sunset over a mountain range, with the sun setting behind the mountains.",
        "label": 3
    },
    "9671767264.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a lake, grassy hills, and a rocky terrain. The scene is set against a backdrop of mountains, and the area is covered in snow.",
        "label": 3
    },
    "4763293627.jpg": {
        "caption": "The image shows a cloudy sky filled with clouds, which appear to be puffy and white.",
        "label": 3
    },
    "aiguestortes_NA_1634_45337508764__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a river flowing through it. The scene is set against a backdrop of mountains, and the river appears to be a natural waterway. The image captures the serene and picturesque beauty of the landscape.",
        "label": 3
    },
    "aiguestortes_NA_1195_52239976525__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a large body of water, such as a lake or a river, reflecting the surrounding scenery. The mountains are covered with trees, and the water appears to be calm and serene.",
        "label": 3
    },
    "6161407443.jpg": {
        "caption": "The image shows a beautiful mountain valley with a lush green hillside, a rocky cliff, and a mountain range in the background. The scene is filled with wildflowers, adding a vibrant touch to the landscape.",
        "label": 3
    },
    "24107043792.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a clear blue sky. The sky is filled with clouds, and the mountain range is covered in snow. The scene is serene and picturesque, showcasing the natural beauty of the mountain range.",
        "label": 3
    },
    "6351336512.jpg": {
        "caption": "The image shows a waterfall flowing down a rocky cliff, with a stream of water cascading down the rocks. The waterfall is surrounded by lush greenery, creating a serene and picturesque scene.",
        "label": 3
    },
    "5329594107.jpg": {
        "caption": "The image shows a beautiful sunset with a mountain range in the background. The sky is filled with clouds, and the sun is setting, creating a stunning view.",
        "label": 3
    },
    "3329892237.jpg": {
        "caption": "The image shows a mountainous landscape with a cloudy sky above. The scene is set in a valley, and there are trees in the foreground. The overall atmosphere of the image is serene and picturesque.",
        "label": 3
    },
    "8927168605.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a clear blue sky. The scene includes a mountain range, a forest, and a rocky hillside. The sky is filled with clouds, adding to the picturesque scenery.",
        "label": 3
    },
    "aiguestortes_NA_5644_30127297372__b.jpg": {
        "caption": "The image shows a mountainous area with a cloudy sky, and it appears to be foggy. The mountains are covered in fog, and the sky is filled with clouds.",
        "label": 3
    },
    "14418318727.jpg": {
        "caption": "The image shows a mountainous landscape with a valley and a mountain range in the background. The scene is captured from a high vantage point, possibly from the top of a mountain or a hill.",
        "label": 3
    },
    "6383187179.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a snow-covered mountain and a valley below. The scene is set against a blue sky, and the mountain is visible in the distance.",
        "label": 3
    },
    "granada_977255_977255_581933008221016065_image_CBNw4KDWgAANI3A.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a rocky cliff, a mountain range, and a clear blue sky. The scene is set in a mountainous area with a rocky cliff, and the sky is bright and clear, providing a stunning backdrop for the landscape.",
        "label": 3
    },
    "32038736582.jpg": {
        "caption": "The image shows a goat standing on a rocky hill or mountain.",
        "label": 1
    },
    "aiguestortes_NA_4530_22285459092__b.jpg": {
        "caption": "The image shows a small bird perched on a tree branch.",
        "label": 1
    },
    "picos_1_490190_1154467449720455168_image_EAV99RCWwAAL7w8.jpg": {
        "caption": "The image shows a group of horses grazing on a grassy hillside.",
        "label": 1
    },
    "aiguestortes_NA_4316_49649005582__b.jpg": {
        "caption": "The image shows a close-up of a pink flower, likely a cherry blossom, with its petals and stamen clearly visible.",
        "label": 1
    },
    "aiguestortes_NA_1265_19925418530__b.jpg": {
        "caption": "The image shows a close-up of a purple flower, possibly a purple iris, with its stem and leaves. The flower is in a grassy area, surrounded by green grass.",
        "label": 1
    },
    "aiguestortes_NA_1261_36623632253__b.jpg": {
        "caption": "The image shows a group of horses standing in a grassy field.",
        "label": 1
    },
    "ordesa_2_409294_1415404286960308226_image_E6SGp2GWUAgyqyp.jpg": {
        "caption": "The image shows a close-up of a red rose, with a mountain in the background. The rose is surrounded by green leaves, and it appears to be growing in a mountainous area.",
        "label": 1
    },
    "15481664139.jpg": {
        "caption": "The image shows a ram, a type of horned animal, standing in a grassy field with rocks in the background.",
        "label": 1
    },
    "aiguestortes_NA_4531_50416980428__b.jpg": {
        "caption": "The image shows a close-up of a green insect, possibly a grasshopper or a similar type of insect, resting on a wooden surface.",
        "label": 1
    },
    "ordesa_2_188644_1535899098942930945_image_FVCcDBFWUAEPTP0.jpg": {
        "caption": "The image shows a close-up of a purple flower, possibly a lilac, with its petals and stamen clearly visible. The flower is situated in a grassy area, surrounded by greenery.",
        "label": 1
    },
    "3562856138.jpg": {
        "caption": "The image shows a close-up of a flower, with a bee sitting on top of it.",
        "label": 1
    },
    "17014327368.jpg": {
        "caption": "The image shows a close-up of a group of yellow flowers, possibly a type of wildflower, growing in a field.",
        "label": 1
    },
    "picos_1_326635_575679374260834304_image_B_05Vv9XAAAF2HT.jpg": {
        "caption": "The image shows a large, wild animal, possibly a goat or a ram, standing on a rocky hillside.",
        "label": 1
    },
    "aiguestortes_NA_4779_51534400886__b.jpg": {
        "caption": "The image shows a close-up of a mushroom growing in the grass.",
        "label": 1
    },
    "6249292736.jpg": {
        "caption": "The image shows a tree filled with blossoms, which are in full bloom. The tree is surrounded by a beautiful blue sky.",
        "label": 1
    },
    "aiguestortes_NA_1042_40386765931__b.jpg": {
        "caption": "The image shows a butterfly flying in the air, with its wings spread out.",
        "label": 1
    },
    "16304228615.jpg": {
        "caption": "The image shows a tree with red leaves, a mountain in the background, and a house in the distance. The tree is located near the mountain, and the house is situated further away from the tree.",
        "label": 1
    },
    "8961095358.jpg": {
        "caption": "The image shows a close-up of two flowers, one red and the other pink, with green stems. The flowers are in a garden setting, and they are surrounded by greenery.",
        "label": 1
    },
    "6926704583.jpg": {
        "caption": "The image shows a close-up of three purple flowers in a field of grass.",
        "label": 1
    },
    "ordesa_2_226140_996877255510020096_image_DdWelCiXcAE1daQ.jpg": {
        "caption": "The image shows a group of horses grazing in a grassy field.",
        "label": 1
    },
    "ordesa_5_246762_1551183692256657408_image_FYbpVy2XoAIaScr.jpg": {
        "caption": "The image shows a single blue flower, possibly an iris, growing in a field.",
        "label": 1
    },
    "peneda_2_235009_883430465809645569_image_DEKTTfcXsAAXchl.jpg": {
        "caption": "The image shows a red flower in a field, with rain falling on it. The flower is surrounded by a green field, and the rain creates a beautiful and serene atmosphere.",
        "label": 1
    },
    "5553139712.jpg": {
        "caption": "The image shows a close-up view of a bunch of green grapes, with sunlight shining through the leaves.",
        "label": 1
    },
    "peneda_1_343086_1441676351254118404_image_FAHc_wqVgAEhMJ4.jpg": {
        "caption": "The image shows a bunch of grapes hanging from a vine, with some of the grapes appearing to be overripe.",
        "label": 1
    },
    "5523730580.jpg": {
        "caption": "The image shows a man walking a horse down a street, with a large bag or sack on the horse's back.",
        "label": 1
    },
    "aiguestortes_NA_4530_31322036067__b.jpg": {
        "caption": "The image shows a small bird perched on a tree branch.",
        "label": 1
    },
    "17488207338.jpg": {
        "caption": "The image shows a close-up of a purple flower, with a focus on its center.",
        "label": 1
    },
    "snev_NA_3360_53095805920__b.jpg": {
        "caption": "The image shows a green and yellow insect, possibly a butterfly or a beetle, sitting on a rock or a stone surface.",
        "label": 1
    },
    "aiguestortes_NA_3322_22082257856__b.jpg": {
        "caption": "The image shows a grass-covered rock with a grasshopper or a similar insect sitting on top of it.",
        "label": 1
    },
    "snev_NA_1603_53691783159__b.jpg": {
        "caption": "The image shows a butterfly perched on a plant or a branch, with its wings spread out.",
        "label": 1
    },
    "snev_NA_6898_52855823675__b.jpg": {
        "caption": "The image shows a small bird perched on a branch, surrounded by greenery.",
        "label": 1
    },
    "3702054860.jpg": {
        "caption": "The image shows a mountain goat standing on a rocky outcropping, with a mountain in the background.",
        "label": 1
    },
    "15736759139.jpg": {
        "caption": "The image shows a small bird perched on a rocky surface, possibly a cliff or a rock.",
        "label": 1
    },
    "snev_NA_646_53623173958__b.jpg": {
        "caption": "The image shows a bird flying in the sky, with another bird flying nearby. The two birds are flying in the same direction, creating a sense of motion and harmony in the scene.",
        "label": 1
    },
    "13807137553.jpg": {
        "caption": "The image shows a herd of sheep grazing on a grassy hillside.",
        "label": 1
    },
    "6190354422.jpg": {
        "caption": "The image shows a close-up of a butterfly flying near a purple flower.",
        "label": 1
    },
    "10175081236.jpg": {
        "caption": "The image shows a series of pictures featuring trees, with each picture focusing on a different tree. The trees are of various sizes and are displayed in different positions, such as close-ups and from a distance. The images capture the beauty and diversity of the trees, providing a visual representation of the natural world.",
        "label": 1
    },
    "aiguestortes_NA_4103_34494535174__b.jpg": {
        "caption": "The image shows a small bird perched on a rock, with a flower in the background.",
        "label": 1
    },
    "aiguestortes_NA_4531_50785605258__b.jpg": {
        "caption": "The image shows a large, colorful chicken standing in a grassy field.",
        "label": 1
    },
    "6425625799.jpg": {
        "caption": "The image shows a close-up of a ladybug, which is a type of insect, sitting on a surface.",
        "label": 1
    },
    "20020917376.jpg": {
        "caption": "The image shows a spider with a large, fat body, and it is eating a caterpillar.",
        "label": 1
    },
    "8264538893.jpg": {
        "caption": "The image shows a group of people standing next to a herd of sheep.",
        "label": 1
    },
    "snev_NA_6898_52855880808__b.jpg": {
        "caption": "The image shows a small bird perched on a tree branch.",
        "label": 1
    },
    "peneda_1_343086_1424057011285676032_image_E8NESlKXMAs15gj.jpg": {
        "caption": "The image shows a group of cows grazing on a grassy hillside.",
        "label": 1
    },
    "guadarrama_NA_1448_28561373537__b.jpg": {
        "caption": "The image shows a close-up view of a dragonfly, a type of insect, with its wings spread out.",
        "label": 1
    },
    "snev_NA_1408_53506114776__b.jpg": {
        "caption": "The image shows a bird perched on a tree branch.",
        "label": 1
    },
    "picos_1_326635_895245952453398529_image_DGyNcSuXcAEXO4p.jpg": {
        "caption": "The image shows a close-up of a purple flower growing in the grass.",
        "label": 1
    },
    "snev_NA_2100_52983089872__b.jpg": {
        "caption": "The image shows a close-up of a yellow flower, possibly a daisy, with its petals and stems visible. The flower is surrounded by thorny stems, which add to the visual interest of the scene.",
        "label": 1
    },
    "aiguestortes_NA_4316_48537875051__b.jpg": {
        "caption": "The image shows a garden with a variety of plants, including flowers and bushes. The plants are growing in a wooded area, and there are several tall plants with flowers on them. The scene is lush and green, showcasing the beauty of nature.",
        "label": 1
    },
    "peneda_1_343086_1440052942623576078_image_E_wYgZfVIA8L3O7.jpg": {
        "caption": "The image shows a small purple flower growing out of a rocky area, with a clear blue sky in the background.",
        "label": 1
    },
    "ordesa_2_188644_1535899098942930945_image_FVCcDByXoAMTP_3.jpg": {
        "caption": "The image shows a close-up of a field of grass with blue flowers growing in it.",
        "label": 1
    },
    "9465538915.jpg": {
        "caption": "The image shows a black cat sitting on a white surface, possibly a wall or a table.",
        "label": 1
    },
    "7396425774.jpg": {
        "caption": "The image shows a large tree with a twisted trunk, surrounded by green leaves. The tree is located next to a stone wall, and it appears to be growing out of the wall.",
        "label": 1
    },
    "guadarrama_NA_1448_42693041345__b.jpg": {
        "caption": "The image shows a close-up of a frog's face, with its eyes and mouth clearly visible.",
        "label": 1
    },
    "6117063949.jpg": {
        "caption": "The image shows a rocky hillside covered with a variety of colorful flowers, including red and yellow ones. The flowers are growing on the rocky terrain, creating a vibrant and lively scene.",
        "label": 1
    },
    "picos_1_424866_609715665696591872_image_CHYlGi7VAAAOdpM.jpg": {
        "caption": "The image shows a group of goats standing together in a grassy area.",
        "label": 1
    },
    "aiguestortes_NA_1334_50030496927__b.jpg": {
        "caption": "The image shows a herd of cows, including a large cow and a baby cow, standing in a grassy field. The cows are grazing on the grass, and there is a mountain in the background.",
        "label": 1
    },
    "aiguestortes_NA_1646_27645183643__b.jpg": {
        "caption": "The image shows a small bird perched on a rock or a piece of concrete.",
        "label": 1
    },
    "peneda_1_343086_709115054155833346_image_CddIXFfWEAILX4l.jpg": {
        "caption": "The image shows a close-up of a blue flower, possibly a wildflower, growing in a field.",
        "label": 1
    },
    "snev_NA_3361_52999458852__b.jpg": {
        "caption": "The image shows a bird perched on a rock, possibly near a waterfall.",
        "label": 1
    },
    "16049568624.jpg": {
        "caption": "The image shows a man standing on a hill, with a donkey standing next to him. The man is holding a stick, and the donkey appears to be looking at him.",
        "label": 1
    },
    "picos_1_329254_1150394647300251649_image_D_cDmv8WwAgOM-Q.jpg": {
        "caption": "The image shows a butterfly sitting on a rocky surface, possibly a gravel road or a rock.",
        "label": 1
    },
    "15580175993.jpg": {
        "caption": "The image shows a cow with long horns, standing in a forest or wooded area.",
        "label": 1
    },
    "ordesa_5_299870_1270388180878008320_image_EaFTSjMWsAITw4S.jpg": {
        "caption": "The image shows a bird perched on a rock, possibly a mountain or a cliff.",
        "label": 1
    },
    "aiguestortes_NA_3014_29162688591__b.jpg": {
        "caption": "The image shows a group of horses walking across a grassy field.",
        "label": 1
    },
    "aiguestortes_NA_4531_24393122980__b.jpg": {
        "caption": "The image shows a close-up of a flower, specifically a yellow flower, with its petals and stems visible. The flower is growing in a field, surrounded by grass.",
        "label": 1
    },
    "guadarrama_NA_1688_51989239357__b.jpg": {
        "caption": "The image shows a close-up of a butterfly sitting on a yellow flower.",
        "label": 1
    },
    "9805533056.jpg": {
        "caption": "The image shows a goat or ram peeking out from behind a rock or a boulder.",
        "label": 1
    },
    "snev_NA_1783_53665282774__b.jpg": {
        "caption": "The image shows a close-up of a flower, specifically a purple orchid, with its petals and stamen clearly visible.",
        "label": 1
    },
    "11162720455.jpg": {
        "caption": "The image shows a tree with green leaves and a bunch of green nuts growing on it.",
        "label": 1
    },
    "snev_NA_2100_52794729379__b.jpg": {
        "caption": "The image shows a bird perched on a tree branch.",
        "label": 1
    },
    "peneda_2_235009_883430465809645569_image_DEKTTfTXUAI3dS1.jpg": {
        "caption": "The image shows a close-up of a beautiful purple flower, possibly a hydrangea, with its petals open. The flower is the main focus of the image, and it appears to be in a garden setting.",
        "label": 1
    },
    "aiguestortes_NA_1646_27486399564__b.jpg": {
        "caption": "The image shows a brown animal, possibly a beaver or a large rodent, sitting in a grassy field.",
        "label": 1
    },
    "4983347894.jpg": {
        "caption": "The image shows a close-up of a purple flower with a green stem, possibly a purple orchid. The flower is in a rocky area, surrounded by rocks and dirt.",
        "label": 1
    },
    "7576619256.jpg": {
        "caption": "The image shows a rocky hillside with a variety of wildflowers growing on it. The flowers are scattered across the hillside, creating a beautiful and natural scene.",
        "label": 1
    },
    "guadarrama_1_407382_1064123138412343298_image_DsSGVN5X4AAIXgx.jpg": {
        "caption": "The image shows a mushroom growing in the woods, surrounded by dirt and pine needles.",
        "label": 1
    },
    "guadarrama_NA_1448_43597621031__b.jpg": {
        "caption": "The image shows a blue dragonfly perched on a branch or a twig.",
        "label": 1
    },
    "ordesa_3_94886_1371875081085988864_image_EwnhGwuXEAQba9d.jpg": {
        "caption": "The image shows a close-up of a flower, likely a daffodil, with its yellow petals and green leaves. The flower is surrounded by a forest-like environment, which adds to the natural beauty of the scene.",
        "label": 1
    },
    "aiguestortes_NA_1646_29449158992__b.jpg": {
        "caption": "The image shows a small bird perched on a rock or a piece of concrete.",
        "label": 1
    },
    "9655070465.jpg": {
        "caption": "The image shows a close-up view of a spider web, with the spider sitting in the center of the web.",
        "label": 1
    },
    "aiguestortes_NA_1646_27473050893__b.jpg": {
        "caption": "The image shows a small yellow bird perched on a rock.",
        "label": 1
    },
    "snev_NA_2100_52950437568__b.jpg": {
        "caption": "The image shows a close-up view of a caterpillar on a stick or branch.",
        "label": 1
    },
    "ordesa_3_135310_1566503155143155713_image_Fb1WTwiX0AE8qsI.jpg": {
        "caption": "The image shows a close-up view of a tree with red berries growing on it.",
        "label": 1
    },
    "aiguestortes_NA_4458_39536197624__b.jpg": {
        "caption": "The image shows a close-up of a flower, with its petals and stamen clearly visible.",
        "label": 1
    },
    "5531977363.jpg": {
        "caption": "The image shows a close-up view of a small brown and white butterfly perched on a plant.",
        "label": 1
    },
    "peneda_1_343086_1441681373064876039_image_FAHhjznXsAMH3s5.jpg": {
        "caption": "The image shows a close-up view of a grape vine with green leaves and grapes growing on it.",
        "label": 1
    },
    "ordesa_1_289664_555318419189673984_image_B7TjKOxIIAALguT.jpg": {
        "caption": "The image shows a close-up of a field of grass, with purple flowers and green plants. The flowers are scattered throughout the grassy area, creating a beautiful and vibrant scene.",
        "label": 1
    },
    "28389432890.jpg": {
        "caption": "The image shows a dead cow lying on the ground in a field.",
        "label": 1
    },
    "aiguestortes_NA_1545_16820597039__b.jpg": {
        "caption": "The image shows a small bird sitting on the ground, surrounded by grass.",
        "label": 1
    },
    "10060247786.jpg": {
        "caption": "The image shows a close-up of a flower, with a couple of insects or small animals sitting on top of it.",
        "label": 1
    },
    "aiguestortes_NA_2807_29391085876__b.jpg": {
        "caption": "The image shows a beaver walking through a grassy field.",
        "label": 1
    },
    "picos_1_513587_1290691012713680896_image_Eel0oBMXkAYYBt5.jpg": {
        "caption": "The image shows a woman standing on a grassy hillside, smiling and posing for a picture. She is wearing a backpack and is surrounded by cows in the background. The scene appears to be a peaceful and picturesque outdoor setting.",
        "label": 1
    },
    "peneda_1_306967_1458527704253444097_image_FD27NTtWYAMtGNg.jpg": {
        "caption": "The image shows a group of mushrooms growing in a grassy area.",
        "label": 1
    },
    "guadarrama_NA_1030_52617576852__b.jpg": {
        "caption": "The image shows a close-up of a bird's head, specifically focusing on its beak and eyes.",
        "label": 1
    },
    "8190013891.jpg": {
        "caption": "The image shows a cow standing in a grassy field, with a rocky hillside in the background.",
        "label": 1
    },
    "picos_1_329254_1150394647300251649_image_D_cFyUvWkAEs66A.jpg": {
        "caption": "The image shows a butterfly sitting on a branch in a grassy area.",
        "label": 1
    },
    "aiguestortes_NA_1269_21719857133__b.jpg": {
        "caption": "The image shows a large, furry animal, possibly a beaver or a groundhog, standing on a rocky surface.",
        "label": 1
    },
    "snev_NA_1506_53518698824__b.jpg": {
        "caption": "The image shows a bird, specifically a woodpecker, standing in a grassy area with tall grass.",
        "label": 1
    },
    "guadarrama_NA_1030_52680686822__b.jpg": {
        "caption": "The image shows a bird, specifically a large eagle, flying in the sky.",
        "label": 1
    },
    "8150000385.jpg": {
        "caption": "The image shows a close-up of a black and blue butterfly perched on a pink flower.",
        "label": 1
    },
    "15889030197.jpg": {
        "caption": "The image shows a close-up of a blackberry bush with many blackberries growing on it. The bush is surrounded by green leaves, and the blackberries are in various stages of ripeness.",
        "label": 1
    },
    "guadarrama_NA_1448_28556683567__b.jpg": {
        "caption": "The image shows a close-up of a yellow and black butterfly or dragonfly perched on a branch.",
        "label": 1
    },
    "guadarrama_NA_1030_52681488624__b.jpg": {
        "caption": "The image shows a bird of prey, specifically a hawk, sitting on a tree branch. The hawk is looking down at a black bird, possibly a crow, which is also perched on a branch nearby.",
        "label": 1
    },
    "aiguestortes_NA_1261_37435999915__b.jpg": {
        "caption": "The image shows two horses walking across a lush green field.",
        "label": 1
    },
    "14752556530.jpg": {
        "caption": "The image shows a close-up of a flower, with a focus on its petals and the surrounding greenery.",
        "label": 1
    },
    "aiguestortes_NA_4531_16560622462__b.jpg": {
        "caption": "The image shows a squirrel sitting on a tree branch, eating a nut.",
        "label": 1
    },
    "ordesa_3_135310_1421786600623718404_image_E7szVo_WUAAiQuJ.jpg": {
        "caption": "The image shows a close-up of a purple flower with white spots, sitting on top of a grassy area.",
        "label": 1
    },
    "6892753441.jpg": {
        "caption": "The image shows a pine cone or pine nut, which is a small, hard, and woody seed that belongs to the pine tree. The pine cone is sitting on a bed of snow, and it appears to be covered in snow as well.",
        "label": 1
    },
    "aiguestortes_NA_1634_42339047952__b.jpg": {
        "caption": "The image shows a large brown cow standing in a grassy field.",
        "label": 1
    },
    "17315054645.jpg": {
        "caption": "The image shows a horse standing in a grassy field, with a fence nearby. The horse is grazing on the grass, and the scene appears to be a peaceful and natural environment.",
        "label": 1
    },
    "picos_1_368252_1297939601336807424_image_EgM1MCYX0AEB1G3.jpg": {
        "caption": "The image shows a brown cow laying down on a grassy hillside.",
        "label": 1
    },
    "ordesa_2_409294_1415404286960308226_image_E6SGnKtXEAUXds9.jpg": {
        "caption": "The image shows a close-up of a red rose with green leaves, sitting on a stem. The rose is in a vase, and it is placed in front of a beautiful mountain landscape.",
        "label": 1
    },
    "8976391991.jpg": {
        "caption": "The image shows a man standing on a street corner, wearing a backpack and sunglasses. He is posing for a picture in front of a building.",
        "label": 5
    },
    "7526674992.jpg": {
        "caption": "The image shows a white building with a staircase leading up to it. The building is situated next to a street, and there is a lamp post in front of it.",
        "label": 5
    },
    "2528701257.jpg": {
        "caption": "The image shows a white building with a patio, surrounded by trees and greenery. The building has a staircase leading to the patio, and there are several potted plants placed around the area.",
        "label": 5
    },
    "15092844284.jpg": {
        "caption": "The image shows a street scene with a man standing next to a car, a building, and a mountain in the background. There are also other people in the scene, and a snowboard is visible in the foreground.",
        "label": 5
    },
    "5267827799.jpg": {
        "caption": "The image shows a woman washing a dog in a bucket.",
        "label": 5
    },
    "6084982231.jpg": {
        "caption": "The image shows a narrow alleyway between two white buildings, with colorful flowers hanging from the buildings. The alleyway is lined with flowers, creating a vibrant and lively atmosphere.",
        "label": 5
    },
    "8116257051.jpg": {
        "caption": "The image shows a narrow alleyway or passageway filled with various plants and flowers. The plants are placed in pots, and the alleyway is lined with them. The scene gives an impression of a lush, green environment.",
        "label": 5
    },
    "9271740527.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a variety of potted plants and flowers lining the path. The plants are placed in pots, and there are also some vases with flowers in them. The scene creates a pleasant and inviting atmosphere for passersby.",
        "label": 5
    },
    "20737258876.jpg": {
        "caption": "The image shows a tree-lined street with trees on both sides. The street is empty, and there is a tree with graffiti on it.",
        "label": 5
    },
    "11671814735.jpg": {
        "caption": "The image shows a snowy street with a snow-covered sidewalk. The street is lined with buildings, and there is a snow-covered balcony on one of the buildings. The scene captures the winter atmosphere and the challenges faced by residents and businesses during the cold season.",
        "label": 5
    },
    "19574857001.jpg": {
        "caption": "The image shows a white building with a doorway and a window. The building has a white exterior and is adorned with curtains. The curtains are hanging from the window, and the doorway is open.",
        "label": 5
    },
    "3253763514.jpg": {
        "caption": "The image shows a window with a flower pot filled with flowers, and a view of a building outside. The window is located on the side of a building, and the flowers are placed in front of it.",
        "label": 5
    },
    "5484820073.jpg": {
        "caption": "The image shows a black metal fence with white flowers on it, located in front of a building. The fence is decorated with white flowers, adding a touch of beauty to the scene.",
        "label": 5
    },
    "7208207084.jpg": {
        "caption": "The image shows a snowy mountain town with a beautiful view of the sun shining through the clouds. The town is surrounded by snow-covered mountains, and the sunlight illuminates the scene, creating a picturesque atmosphere.",
        "label": 5
    },
    "6201363071.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a small stream of water flowing through it. The alleyway is surrounded by stone walls, and there is a small bridge over the stream. The scene also includes a staircase leading to the alleyway.",
        "label": 5
    },
    "8631538356.jpg": {
        "caption": "The image shows a row of parked motor scooters or mopeds, lined up along a street or a wall.",
        "label": 5
    },
    "6243115801.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a wooden barrel and a potted plant placed on the sidewalk. The alleyway is lined with potted plants, and there is a wooden barrel on the sidewalk as well.",
        "label": 5
    },
    "15552858488.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a variety of potted plants lining the path. The plants are placed in pots, and they add a touch of greenery to the urban environment.",
        "label": 5
    },
    "1931164006.jpg": {
        "caption": "The image shows a white building with a vine growing up its side. The building has a white facade, and there are flowers growing on the side of the building.",
        "label": 5
    },
    "13992749717.jpg": {
        "caption": "The image shows a brick walkway or sidewalk, with a curve in it. The walkway is located next to a building, and it appears to be a part of a larger brick structure.",
        "label": 5
    },
    "10460621504.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a man standing in the alley. The alley is lined with stone buildings, and there is a chimney on one of the buildings. The scene appears to be in black and white, giving it a classic or vintage feel.",
        "label": 5
    },
    "28580799241.jpg": {
        "caption": "The image shows a small patio with a variety of potted plants and flowers. The plants are placed in different sizes and shapes, creating a visually appealing and lively atmosphere.",
        "label": 5
    },
    "snev_NA_8801_53424836486__b.jpg": {
        "caption": "The image shows a street in a small town, with a row of houses and buildings lining the street. The street is lined with buildings, and there is a small car driving down the street.",
        "label": 5
    },
    "5563901376.jpg": {
        "caption": "The image shows a snowy mountain landscape at night, with a building and a ski resort in the foreground. The scene is illuminated by the moon, creating a serene and picturesque atmosphere.",
        "label": 5
    },
    "5417539067.jpg": {
        "caption": "The image shows a snowy street scene with a large building in the background. There are several people walking on the snowy street, and a woman is standing under a street light. The street is lined with buildings, and the overall atmosphere suggests a wintery setting.",
        "label": 5
    },
    "6829731880.jpg": {
        "caption": "The image shows a tall white tower, possibly a lighthouse, standing in the middle of a cloudy sky.",
        "label": 5
    },
    "25685905521.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a variety of potted plants and flowers lining the street.",
        "label": 5
    },
    "33424378354.jpg": {
        "caption": "The image shows a group of people standing outside, possibly in a parking lot or a similar outdoor area.",
        "label": 5
    },
    "5037849777.jpg": {
        "caption": "The image shows a variety of potted plants and flowers displayed on a balcony or terrace.",
        "label": 5
    },
    "3212317541.jpg": {
        "caption": "The image shows a beautiful mountainous area with a town situated at the base of a hill. The town is surrounded by a lush green landscape, and it appears to be a quaint and picturesque location.",
        "label": 5
    },
    "24476241034.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a small doorway and a staircase leading to the upper floor. The alleyway is located in a small village, and the buildings on either side of the alleyway have a white color.",
        "label": 5
    },
    "22233128039.jpg": {
        "caption": "The image shows a tree with green leaves, parked cars, and a street sign. The tree is located near the parked cars, and the street sign is visible in the background.",
        "label": 5
    },
    "24651464870.jpg": {
        "caption": "The image shows a patio area with wooden chairs and tables covered in snow. The chairs and tables are placed outside, and the snow has accumulated on them.",
        "label": 5
    },
    "5462074295.jpg": {
        "caption": "The image shows a snowy mountain landscape with a town at the base of the mountain. The town is surrounded by a beautiful snowy mountain, and the scene is illuminated by streetlights.",
        "label": 5
    },
    "4262939988.jpg": {
        "caption": "The image shows a stone fountain in a courtyard, with a tree nearby. The fountain is located in the middle of a sidewalk, and it appears to be a focal point in the area.",
        "label": 5
    },
    "8723228313.jpg": {
        "caption": "The image shows a beautiful mountainous area with a town situated at the base of the mountain. The town is surrounded by green hills and mountains, creating a picturesque landscape.",
        "label": 5
    },
    "snev_NA_4340_53664568455__b.jpg": {
        "caption": "The image shows a large building with a sign on it, located next to a river. The building appears to be a hotel or a similar establishment, as it is situated near a bridge and a waterway.",
        "label": 5
    },
    "snev_NA_4340_53634358102__b.jpg": {
        "caption": "The image shows a pig statue, which is a part of a monument or a sign, located on a street corner.",
        "label": 5
    },
    "3237806650.jpg": {
        "caption": "The image shows a row of potted plants lined up along a sidewalk.",
        "label": 5
    },
    "2983803003.jpg": {
        "caption": "The image shows a white building with a doorway, a tree with white flowers, and a white door. The building appears to be a church, and the tree with white flowers adds a touch of natural beauty to the scene.",
        "label": 5
    },
    "6877558552.jpg": {
        "caption": "The image shows a cityscape with a large mountain in the background. The city is situated at the base of the mountain, and the skyline is visible in the distance.",
        "label": 5
    },
    "6351088028.jpg": {
        "caption": "The image shows a building with a balcony filled with colorful flowers and potted plants. The flowers are arranged in various pots, creating a vibrant and lively atmosphere.",
        "label": 5
    },
    "snev_NA_5374_52878276400__b.jpg": {
        "caption": "The image shows a small village or town situated on a hillside, with houses and buildings built into the side of the hill. The village is surrounded by a mountainous landscape.",
        "label": 5
    },
    "14096993620.jpg": {
        "caption": "The image shows a flower shop with a variety of flowers displayed in pots and vases. The flowers are arranged in an aesthetically pleasing manner, creating an inviting atmosphere for customers.",
        "label": 5
    },
    "4487464067.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a staircase leading up to the buildings. The alleyway is made of stone, and the buildings on either side appear to be old.",
        "label": 5
    },
    "13743182995.jpg": {
        "caption": "The image shows a narrow alleyway between two white buildings, with a staircase leading up to the buildings. The alleyway is lined with potted plants, creating a pleasant and inviting atmosphere.",
        "label": 5
    },
    "16994636907.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a small stream of water running through it. The alleyway is lined with buildings on both sides, and there is a man standing on the side of the alley.",
        "label": 5
    },
    "8868786113.jpg": {
        "caption": "The image shows a narrow alleyway between two white buildings, with a street light on the side. The alleyway is lined with flowers, giving it a charming and colorful appearance.",
        "label": 5
    },
    "6964737262.jpg": {
        "caption": "The image shows a narrow alleyway or passageway between two buildings, with a set of stone steps leading up to the entrance of one of the buildings. The alleyway appears to be made of stone, giving it a unique and historic appearance.",
        "label": 5
    },
    "10520496056.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a doorway leading to a courtyard. The alleyway is dark and appears to be a dead-end street.",
        "label": 5
    },
    "23085402461.jpg": {
        "caption": "The image shows a courtyard with a staircase leading to a building. The courtyard is filled with various plants and flowers, creating a lush and vibrant atmosphere. The staircase is located next to a building, and there are potted plants and flowers placed throughout the scene.",
        "label": 5
    },
    "8869329532.jpg": {
        "caption": "The image shows a beautiful mountainous area with a town or village nestled in the valley. The town is surrounded by a lush green forest, and the sun is shining on the scene, creating a picturesque view.",
        "label": 5
    },
    "6296852519.jpg": {
        "caption": "The image shows a snow-covered pine tree in front of a building.",
        "label": 5
    },
    "9271739281.jpg": {
        "caption": "The image shows a variety of potted plants and flowers displayed on a window sill.",
        "label": 5
    },
    "3223986258.jpg": {
        "caption": "The image shows a view of a white building with a red roof, located in a mountainous area. The building is situated on a hillside, and there is a street light nearby. The scene also includes a mountainous landscape, with a mountain range visible in the background.",
        "label": 5
    },
    "5849097109.jpg": {
        "caption": "The image shows a rooftop with a view of the surrounding area, including a city and a mountain. The rooftop has a windmill, and there are two vases on display. The scene also features a building with a windmill on top of it.",
        "label": 5
    },
    "15455154893.jpg": {
        "caption": "The image shows a white building with two doors, each having a colorful curtain or striped drape. The building appears to be a small house or a similar structure.",
        "label": 5
    },
    "6792573980.jpg": {
        "caption": "The image shows a cityscape with a large city in the background, surrounded by a mountain range. The city is located near the base of the mountain range.",
        "label": 5
    },
    "4488110822.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a cobblestone street and a stone staircase leading up to the buildings. The alleyway is lined with stone steps and appears to be a pedestrian-only passage.",
        "label": 5
    },
    "3781549700.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a doorway on one side and a balcony with potted plants on the other side. The alleyway is lined with potted plants, creating a pleasant atmosphere.",
        "label": 5
    },
    "9112825471.jpg": {
        "caption": "The image shows a sketchbook with a drawing of a house, a chair, and a potted plant. The drawing is on a yellow page of the sketchbook.",
        "label": 5
    },
    "12086035304.jpg": {
        "caption": "The image shows a stone building with a window, possibly a stone house or a stone building with a window.",
        "label": 5
    },
    "542519496.jpg": {
        "caption": "The image shows a woman wearing a purple headscarf, sitting on a stone wall or a stone staircase. She is looking down, possibly at the ground or something else below her.",
        "label": 5
    },
    "7101684937.jpg": {
        "caption": "The image shows a group of white pillars or posts, each with a rock or stone on top of it. These pillars are arranged in a row, and they are situated in a rocky area or desert.",
        "label": 5
    },
    "10809414443.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a cobblestone or stone surface. The alleyway is lined with potted plants, creating a pleasant and green atmosphere.",
        "label": 5
    },
    "15203261111.jpg": {
        "caption": "The image shows a large building with many windows, located in a city. The building is situated on a hill, and it appears to be a multi-story structure.",
        "label": 5
    },
    "6826001420.jpg": {
        "caption": "The image shows a view of a town from a window, with a mountain in the background.",
        "label": 5
    },
    "12383415163.jpg": {
        "caption": "The image shows a snowy mountain landscape with a city in the background. The city is surrounded by a mountain range, and the snow-covered mountain range is visible in the distance.",
        "label": 5
    },
    "7461397422.jpg": {
        "caption": "The image shows a group of three stone structures, possibly stone towers or stone pillars, standing next to each other.",
        "label": 5
    },
    "24479990783.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a staircase leading up to the buildings. The alleyway is made of stone and appears to be a passage between the buildings.",
        "label": 5
    },
    "3365930896.jpg": {
        "caption": "The image shows a street view of a small village, with a restaurant and a building with a balcony. The scene is set in a mountainous area, and the sun is shining on the village.",
        "label": 5
    },
    "32521601195.jpg": {
        "caption": "The image shows a beautiful mountain village with a variety of potted plants and flowers lining the streets. The village is situated on a hillside, and the potted plants are placed on the side of the road, adding a touch of greenery to the area.",
        "label": 5
    },
    "6991056841.jpg": {
        "caption": "The image shows a cityscape with a large mountain in the background. The city is filled with buildings, and there are many people walking around. The scene also includes a street with apartment buildings and apartment balconies.",
        "label": 5
    },
    "15644678256.jpg": {
        "caption": "The image shows a white building with blue doors, located on a hillside. The building has a stone exterior and is surrounded by greenery, including trees and bushes.",
        "label": 5
    },
    "5184729435.jpg": {
        "caption": "The image shows a small white house with a chimney, located on a rocky hillside. The house appears to be in a remote area, possibly in a desert-like environment.",
        "label": 5
    },
    "20733389551.jpg": {
        "caption": "The image shows a narrow alleyway between two white buildings, with a street light on the side of one of the buildings. The alleyway is lined with white buildings, and there is a street light on the side of one of the buildings.",
        "label": 5
    },
    "18078709725.jpg": {
        "caption": "The image shows a rooftop with a row of chimneys, which are part of a building. The rooftop is covered with a black roof, and there is a tree in the background.",
        "label": 5
    },
    "20813616528.jpg": {
        "caption": "The image shows a city street with a row of houses and buildings on a hill. The street is filled with parked cars, and there is a mountain in the background.",
        "label": 5
    },
    "7065174273.jpg": {
        "caption": "The image shows a street with a set of stairs leading up to a building. The stairs are made of stone, and there is a tree in the background. The scene also includes a white building and a doorway.",
        "label": 5
    },
    "15475577520.jpg": {
        "caption": "The image shows a large white bus driving down a street, with a mountain in the background.",
        "label": 5
    },
    "6773748963.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a street light hanging over the alley. The alley is lined with buildings on both sides, and it appears to be a quiet, residential area.",
        "label": 5
    },
    "23219330009.jpg": {
        "caption": "The image shows a patio area with a table and chairs, surrounded by various plants and flowers. The patio is located under a wooden structure, possibly a wooden roof or a wooden building.",
        "label": 5
    },
    "5666289972.jpg": {
        "caption": "The image shows a kitchen with a sink and a brick wall. There is also a large vase sitting on the kitchen counter.",
        "label": 5
    },
    "4634480533.jpg": {
        "caption": "The image shows a woman walking down the street, passing by a red and white truck. The truck is parked on the side of the road, and the woman is carrying a handbag.",
        "label": 5
    },
    "2635391613.jpg": {
        "caption": "The image shows a woman standing on a balcony of a building, possibly a hotel or an apartment. She is holding a broom, which suggests that she might be cleaning the balcony or the surrounding area.",
        "label": 5
    },
    "8995510084.jpg": {
        "caption": "The image shows a snowy hillside with a staircase leading up the hill. The stairs are surrounded by snow, and there are buildings in the background.",
        "label": 5
    },
    "6970484181.jpg": {
        "caption": "The image shows a window with a metal grate or bars on it, casting a shadow on the building.",
        "label": 5
    },
    "18102875606.jpg": {
        "caption": "The image shows a beautiful mountainous area with a small village nestled in the valley. The village is surrounded by a lush green hillside, and the sky is visible above the village.",
        "label": 5
    },
    "9841518585.jpg": {
        "caption": "The image shows a man and a woman walking down a narrow alleyway between buildings. The alleyway is lined with plants and flowers, creating a pleasant atmosphere.",
        "label": 5
    },
    "8449989605.jpg": {
        "caption": "The image shows a group of people gathered outside a white building, possibly a church or a house. They are standing around and talking to each other.",
        "label": 5
    },
    "16484509484.jpg": {
        "caption": "The image shows a street in a small town, with a row of houses on one side and a row of shops on the other side. The street is lined with potted plants, and there are several cars parked along the street.",
        "label": 5
    },
    "27804012380.jpg": {
        "caption": "The image shows a large city with many buildings, including apartment buildings and houses. The city is situated on a hill, and it is surrounded by a beautiful mountain landscape.",
        "label": 5
    },
    "15576564732.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a variety of potted plants and flowers lining the path. The alleyway is lined with potted plants and flowers, creating a beautiful and lively atmosphere.",
        "label": 5
    },
    "6736334513.jpg": {
        "caption": "The image shows a man working on a bicycle, possibly fixing or assembling it. The bicycle is located in a room with a tile floor.",
        "label": 5
    },
    "8358362493.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a staircase leading up to the buildings. The alleyway is lined with flowers and potted plants, creating a beautiful and lively atmosphere.",
        "label": 5
    },
    "snev_NA_5375_53287039458__b.jpg": {
        "caption": "The image shows a woman standing in a living room, posing for a picture.",
        "label": 5
    },
    "13664649045.jpg": {
        "caption": "The image shows a snowy town with a large building, possibly a hotel, surrounded by snow. The town is bustling with activity, as there are many people walking around and enjoying the winter atmosphere.",
        "label": 5
    },
    "28801121922.jpg": {
        "caption": "The image shows a beautiful mountainous area with a town situated on the side of a hill. The town is surrounded by greenery, and the sky is blue, creating a picturesque scene.",
        "label": 5
    },
    "16981118958.jpg": {
        "caption": "The image shows a narrow alleyway between two white buildings, with a variety of plants and flowers lining the path.",
        "label": 5
    },
    "2266887190.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a street light illuminating the area. The alleyway is lined with buildings on both sides, and there is a street light hanging over the alley.",
        "label": 5
    },
    "5954134288.jpg": {
        "caption": "The image shows a beautiful view of a hillside with a fence and a gate. The hillside is covered with greenery, and there are houses on the hill. The scene also includes a street with a fence and a gate, as well as a house with a fence and a gate.",
        "label": 5
    },
    "14742565259.jpg": {
        "caption": "The image shows a man wearing sunglasses, sitting on a chair outside a building. He is positioned in front of a potted plant, and there is a doorway nearby. The scene appears to be set in a courtyard or an outdoor area.",
        "label": 5
    },
    "3983873267.jpg": {
        "caption": "The image shows a white building, possibly a house or a small building, with a tree in front of it. The building is situated on a dirt road, and there is a small garden in front of it.",
        "label": 5
    },
    "7933201696.jpg": {
        "caption": "The image shows a woman sitting on a stone wall, possibly on a staircase, with her hand on her face. She is wearing a green tank top and appears to be looking down.",
        "label": 5
    },
    "2056170462.jpg": {
        "caption": "The image shows a large white building with a red roof, which is a hotel. The hotel is situated in a mountainous area, and there is a mountain in the background.",
        "label": 5
    },
    "2090206236.jpg": {
        "caption": "The image shows a woman standing on a street, wearing sunglasses and a white shirt. She is also holding a handbag. The street is lined with buildings, and there are several other people in the scene. The woman appears to be enjoying her time in the city, possibly taking a break from her daily activities.",
        "label": 5
    },
    "6893155194.jpg": {
        "caption": "The image shows a beautiful mountainous area with a small village nestled in the valley. The village is surrounded by a mountain range, and the skyline is visible in the background. The scene is picturesque and captures the essence of a quaint, rural setting.",
        "label": 5
    },
    "3789718920.jpg": {
        "caption": "The image shows a woman walking down a pathway or alleyway, surrounded by flowers and plants. She is carrying a handbag as she makes her way through the scenic area.",
        "label": 5
    },
    "10940773136.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a mountain in the background. The alleyway is lined with greenery, and there is a streetlight in the middle of the scene.",
        "label": 5
    },
    "12349056745.jpg": {
        "caption": "The image shows a cityscape at night, with a view of a city from a hill. The city is illuminated by lights, creating a beautiful and captivating scene.",
        "label": 5
    },
    "18892464530.jpg": {
        "caption": "The image shows a beautiful mountain town with a mix of houses and buildings, as well as a lush green hillside. The town is situated on a hill, and the houses are scattered throughout the area.",
        "label": 5
    },
    "17719592369.jpg": {
        "caption": "The image shows a snowy mountain landscape with a town or city in the background. The town is surrounded by snow-covered mountains, and the sky is blue.",
        "label": 5
    },
    "peneda_1_306967_1543561855800582148_image_FWvVU72WQAAG5Tz.jpg": {
        "caption": "The image shows a wooden platter or tray with a variety of cheeses and other food items on it.",
        "label": 2
    },
    "snev_NA_1508_53540943815__b.jpg": {
        "caption": "The image shows a plate of food, which includes a piece of fish, vegetables, and possibly some meat. The plate is placed on a dining table.",
        "label": 2
    },
    "snev_NA_1508_52677789415__b.jpg": {
        "caption": "The image shows a man sitting at a table with a plate of food in front of him. He is smiling and appears to be enjoying his meal.",
        "label": 2
    },
    "aiguestortes_NA_3934_51439014916__b.jpg": {
        "caption": "The image shows a piece of cooked fish, specifically a piece of salmon, sitting on a plate.",
        "label": 2
    },
    "granada_NA_1569_27326672876__b.jpg": {
        "caption": "The image shows a table filled with a variety of foods, including a plate of fried shrimp, a plate of pasta, and a plate of vegetables. There are also drinks and utensils on the table.",
        "label": 2
    },
    "granada_NA_1569_18238955241__b.jpg": {
        "caption": "The image shows a plate of food, which includes a sandwich, chips, and olives. The plate is placed on a dining table.",
        "label": 2
    },
    "peneda_1_343086_1315026742873030656_image_Ej_p0eaXkAIVjX_.jpg": {
        "caption": "The image shows a large pot filled with a delicious-looking meal, which includes noodles, vegetables, and possibly meat. The pot is placed on a table, and there are two spoons in the pot, one on the left side and the other on the right side.",
        "label": 2
    },
    "granada_NA_1515_29492555041__b.jpg": {
        "caption": "The image shows a plate of food, which includes fries and a glass of wine. The plate is placed on a dining table, and there is a person sitting at the table.",
        "label": 2
    },
    "granada_NA_1569_37341035666__b.jpg": {
        "caption": "The image shows a wooden tray or cutting board with a variety of vegetables and fruits on it. The vegetables and fruits include tomatoes, cucumbers, and possibly other items.",
        "label": 2
    },
    "peneda_1_343086_1530510561112477697_image_FT13PDtXwAAVi9a.jpg": {
        "caption": "The image shows a breakfast plate with eggs, ham, and pancakes. The plate is placed on a dining table, and there is a glass of orange juice next to it.",
        "label": 2
    },
    "25444451341.jpg": {
        "caption": "The image shows a plate of food, which includes eggs, sausage, and other items. The plate is placed on a dining table.",
        "label": 2
    },
    "peneda_1_343086_1441736446168031233_image_FAITpjAXoAAl_4c.jpg": {
        "caption": "The image shows a plate of food, which includes rice, beans, and meat, along with a bowl of red liquid. The plate is placed on a dining table, and there is a fork and a knife nearby.",
        "label": 2
    },
    "granada_NA_1569_28251973500__b.jpg": {
        "caption": "The image shows a glass filled with a variety of fruits, including apples, oranges, and possibly other fruits. The glass is placed on a table, and the fruits are arranged in a visually appealing manner.",
        "label": 2
    },
    "peneda_1_373660_1566067862401417216_image_FbvKaQsXwAE-Wtx.jpg": {
        "caption": "The image shows a slice of cake or a dessert, which is placed on a plate or a bowl. The dessert appears to be a layered cake or a pastry, and it is served with a sauce or syrup.",
        "label": 2
    },
    "peneda_2_235009_1097144414215069697_image_DznW_bfXcAEg1vz.jpg": {
        "caption": "The image shows a plate of food, which includes rice, meat, and vegetables. The plate is placed on a dining table.",
        "label": 2
    },
    "1843940935.jpg": {
        "caption": "The image shows a large display of cooked and cured meats, including ham and sausage, hanging from the ceiling.",
        "label": 2
    },
    "granada_NA_1569_36708247034__b.jpg": {
        "caption": "The image shows a plate filled with sliced meat, likely ham, and some sauce. The plate is placed on a table.",
        "label": 2
    },
    "ordesa_2_188644_1007727526163120129_image_Dfwq1XrXUAE5sob.jpg": {
        "caption": "The image shows a group of people sitting around a dining table, enjoying a meal together.",
        "label": 2
    },
    "granada_NA_1514_16038631257__b.jpg": {
        "caption": "The image shows a plate of food, specifically a roast beef sandwich, sitting on a dining table.",
        "label": 2
    },
    "guadarrama_NA_1935_17521870249__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of items such as meat, fries, and breaded foods. The plate is placed on a table.",
        "label": 2
    },
    "granada_NA_1569_26998964242__b.jpg": {
        "caption": "The image shows a dessert, specifically a cake, served in a glass jar or a small glass dish. The dessert is placed on a plate, and there is a napkin underneath it.",
        "label": 2
    },
    "peneda_2_189266_1548418140618444800_image_FX0WFOnUIAcwPHc.jpg": {
        "caption": "The image shows a close-up view of a pizza with various toppings, including mushrooms and cheese. The pizza is placed on a metal tray or a pizza pan.",
        "label": 2
    },
    "aiguestortes_NA_1619_28872141055__b.jpg": {
        "caption": "The image shows a restaurant setting with a woman standing behind a bar, serving drinks to customers. The bar is well-stocked with various bottles, and there are several chairs and dining tables arranged throughout the space. The scene captures the atmosphere of a restaurant where patrons can enjoy food and beverages.",
        "label": 2
    },
    "guadarrama_1_318396_1457001597314256902_image_FDhPOh4XMAMVtSn.jpg": {
        "caption": "The image shows a table with plates of food, including eggs, fries, and a bowl of soup. There are also drinks on the table, and a sandwich is present as well. The table is set for a meal, and the food appears to be ready to be eaten.",
        "label": 2
    },
    "9706222005.jpg": {
        "caption": "The image shows a group of people sitting at a table, enjoying a meal together. They are seated on chairs, and there are various items on the table, such as cups, bowls, and a wine glass. The scene appears to be a pleasant gathering or a family meal.",
        "label": 2
    },
    "granada_NA_1516_24030347533__b.jpg": {
        "caption": "The image shows a buffet table filled with various foods and drinks. The table is set up with a variety of dishes, including a juice dispenser, and it appears to be a breakfast buffet.",
        "label": 2
    },
    "guadarrama_NA_1935_16481511903__b.jpg": {
        "caption": "The image shows a bowl of soup, which is filled with vegetables and beans. The soup is placed on a dining table, and there is a spoon in the bowl.",
        "label": 2
    },
    "picos_1_448402_1290371010433363970_image_EehRkuPXoAAqLoH.jpg": {
        "caption": "The image shows a man sitting at a table, holding a glass of beer. He is smiling and appears to be enjoying his time.",
        "label": 2
    },
    "granada_NA_1569_36701251353__b.jpg": {
        "caption": "The image shows a couple sitting at a table with a beautiful view of the city. They are enjoying their meal together, with a variety of food items and drinks on the table.",
        "label": 2
    },
    "aiguestortes_NA_1619_28872141475__b.jpg": {
        "caption": "The image shows a close-up view of a piece of bread, which is placed on a tray or a plate.",
        "label": 2
    },
    "guadarrama_NA_1935_17705629892__b.jpg": {
        "caption": "The image shows a plate of food, which includes fish, peppers, and possibly other vegetables. The food is arranged on a black plate, and there are also some peppers on the side.",
        "label": 2
    },
    "guadarrama_NA_2057_17130644837__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of dishes such as beans, meat, and other food items. The plate is placed on a dining table.",
        "label": 2
    },
    "guadarrama_NA_1935_15947164214__b.jpg": {
        "caption": "The image shows a small bowl of soup placed on a saucer, accompanied by a glass of wine. The bowl of soup is sitting on a saucer, and the glass of wine is positioned next to it.",
        "label": 2
    },
    "ordesa_5_202352_1310234674766241792_image_Ei7jfCWXsAAsyEj.jpg": {
        "caption": "The image shows a slice of pie on a plate, accompanied by a cup of coffee. The pie is placed on a wooden table, and the scene appears to be set in a mountainous area.",
        "label": 2
    },
    "7598948890.jpg": {
        "caption": "The image shows a group of men sitting at a table, looking at a menu. They are likely at a restaurant or a similar dining establishment.",
        "label": 2
    },
    "guadarrama_NA_1935_51979629036__b.jpg": {
        "caption": "The image shows a plate of food, which includes meat, potatoes, and a sauce. The plate is placed on a dining table.",
        "label": 2
    },
    "5918993653.jpg": {
        "caption": "The image shows a table set for a meal, with a beautiful view of the mountains in the background. The table is set with plates, silverware, and napkins, creating an inviting atmosphere for a dining experience.",
        "label": 2
    },
    "snev_NA_1508_53540943840__b.jpg": {
        "caption": "The image shows a table with plates of food, including a variety of appetizers and a dish of breaded food. There are also some vegetables on the table.",
        "label": 2
    },
    "aiguestortes_NA_1619_28796105081__b.jpg": {
        "caption": "The image shows a menu, which is a list of food items and their prices. The menu is displayed on a table, and it appears to be a restaurant menu.",
        "label": 2
    },
    "picos_1_448402_1290371010433363970_image_EehRkuOXsAAYkjo.jpg": {
        "caption": "The image shows a group of men sitting at a wooden dining table, enjoying a meal together. They are smiling and posing for a picture, with a variety of food items on the table.",
        "label": 2
    },
    "peneda_2_183870_1547563742426062849_image_FXoM_ShUsAIXZ_A.jpg": {
        "caption": "The image shows a plate of food, specifically a steak, which is sliced and ready to be eaten.",
        "label": 2
    },
    "granada_NA_1516_24030347833__b.jpg": {
        "caption": "The image shows a table filled with a variety of pastries, including donuts and other sweet treats. The table is set up for a buffet, and the pastries are displayed in a visually appealing manner.",
        "label": 2
    },
    "granada_NA_1569_46120381524__b.jpg": {
        "caption": "The image shows a close-up view of a plate filled with various food items, including sandwiches, tomatoes, and other vegetables.",
        "label": 2
    },
    "granada_NA_1567_48044792733__b.jpg": {
        "caption": "The image shows a bowl filled with a variety of foods, including rice, vegetables, and possibly some meat. The bowl is placed on a dining table.",
        "label": 2
    },
    "picos_1_330090_1008446598630789120_image_Df641kiXUAAd0Tn.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of vegetables and possibly some meat. The plate is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1569_27288491291__b.jpg": {
        "caption": "The image shows a dining table with a plate of food, a fork, and a glass of beer. The food on the plate appears to be a dish with rice and vegetables.",
        "label": 2
    },
    "granada_NA_1515_26496426172__b.jpg": {
        "caption": "The image shows a close-up of a sandwich on a plate, with bacon and a side of a glass of orange juice.",
        "label": 2
    },
    "peneda_2_183870_1547563742426062849_image_FXoM-AbVQAA6hEH.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of vegetables and a piece of meat, possibly chicken. The plate is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1569_27289540621__b.jpg": {
        "caption": "The image shows a plate of sliced tomatoes, with a spoon resting on top of the tomatoes.",
        "label": 2
    },
    "granada_NA_1460_49101463488__b.jpg": {
        "caption": "The image shows a table with plates of food, including rice and a variety of other dishes. There are also some apples on the table.",
        "label": 2
    },
    "20498164588.jpg": {
        "caption": "The image shows a table with a plate of food, which includes a variety of meats and bread. There are also several bottles on the table, possibly containing beverages. The table is set up for a meal, and there are chairs around it, suggesting that people are about to sit down and enjoy the food.",
        "label": 2
    },
    "granada_NA_1513_30940686051__b.jpg": {
        "caption": "The image shows a man standing in a kitchen, holding a plate of food. The kitchen has a tiled wall, and there is a menu on the wall as well.",
        "label": 2
    },
    "peneda_1_539861_1598770798566821888_image_Fi_5jt3WQAA40Tc.jpg": {
        "caption": "The image shows a plate of food, which includes a loaf of bread and some meat. The food is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1569_37160465650__b.jpg": {
        "caption": "The image shows a close-up of a bowl filled with sliced tomatoes.",
        "label": 2
    },
    "2134564411.jpg": {
        "caption": "The image shows a man standing in front of a wall full of hanging pork products, such as pork chops and pork ribs.",
        "label": 2
    },
    "peneda_1_306967_1344389280903409666_image_Eqg6yeeW8AEw9ft.jpg": {
        "caption": "The image shows a person holding a bottle of beer, specifically a Sagres Mini beer, in front of a fireplace.",
        "label": 2
    },
    "peneda_1_305170_1476178885918212102_image_FHxw2kVXwAgkXae.jpg": {
        "caption": "The image shows a slice of cheesecake on a plate, with a sauce drizzled over it. The cheesecake appears to be a dessert, and the sauce adds a flavorful touch to the dish.",
        "label": 2
    },
    "peneda_1_539861_1598770798566821888_image_Fi_5kWwXEA490iq.jpg": {
        "caption": "The image shows a small cup of coffee or espresso, with a spoon resting inside it. The cup is placed on a saucer, and the spoon is positioned at the bottom of the cup.",
        "label": 2
    },
    "granada_NA_1513_30941180401__b.jpg": {
        "caption": "The image shows a man holding a bottle of wine, possibly a bottle of Chateau Margaux.",
        "label": 2
    },
    "5143540019.jpg": {
        "caption": "The image shows a wall with a row of red peppers or chili hanging from it.",
        "label": 2
    },
    "peneda_1_393104_1562442460777054209_image_Fa7pIXFVsAA7MR0.jpg": {
        "caption": "The image shows a bottle of Super Bock beer and a glass of beer on a table.",
        "label": 2
    },
    "snev_NA_1508_53540520451__b.jpg": {
        "caption": "The image shows a close-up of a small plate of food, which includes a variety of food items such as potatoes, cheese, and other ingredients.",
        "label": 2
    },
    "granada_NA_1569_16495160525__b.jpg": {
        "caption": "The image shows a plate of food, which includes a bowl of soup, a slice of meat, and a side of vegetables. The plate is placed on a dining table.",
        "label": 2
    },
    "aiguestortes_NA_1619_33676772871__b.jpg": {
        "caption": "The image shows a bowl filled with a variety of foods, including vegetables and rice. The bowl is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1036_16552056024__b.jpg": {
        "caption": "The image shows a small pastry, possibly a dessert or a sweet treat, sitting on a plate. The pastry is placed on a white plate, and there is a fork next to it.",
        "label": 2
    },
    "16748429757.jpg": {
        "caption": "The image shows a white plate with a small, round, and crispy food item on it.",
        "label": 2
    },
    "granada_NA_1567_48044793863__b.jpg": {
        "caption": "The image shows a plate of food, which includes a meat dish and a salad. The plate is placed on a table, and there are also some drinks and a wine glass on the table.",
        "label": 2
    },
    "23173342474.jpg": {
        "caption": "The image shows a store or shop with a large display of hams hanging from the ceiling. The hams are arranged in an overhead manner, creating an impressive and eye-catching presentation.",
        "label": 2
    },
    "picos_1_489325_1278461406946430976_image_Eb4B3bQWkAAd1H8.jpg": {
        "caption": "The image shows a plate of food, which includes a fried egg, carrots, and possibly other vegetables. The plate is placed on a table.",
        "label": 2
    },
    "peneda_2_235009_827857511797624832_image_C30kAPWWAAAODQs.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of vegetables and possibly some meat. The plate is placed on a dining table.",
        "label": 2
    },
    "aiguestortes_NA_1553_49704457123__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of beans, pasta, and possibly some meat. The plate is filled with a mix of different food items, creating a diverse and appetizing meal.",
        "label": 2
    },
    "granada_NA_1569_40457880732__b.jpg": {
        "caption": "The image shows a bowl filled with various fruits and ice cream. The bowl contains a mix of fruits, including apples, strawberries, and possibly other fruits. The ice cream is served alongside the fruits, creating a visually appealing and delicious dessert.",
        "label": 2
    },
    "aiguestortes_NA_1619_32149396937__b.jpg": {
        "caption": "The image shows a plate of food, which includes shrimp, lemon, and cinnamon. The plate is placed on a table, and there are also some crackers and a bowl of food nearby.",
        "label": 2
    },
    "granada_NA_1569_37999443504__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of vegetables, seafood, and a sauce. The dish appears to be a mix of different ingredients, creating a visually appealing and potentially nutritious meal.",
        "label": 2
    },
    "5547921397.jpg": {
        "caption": "The image shows a pile of cooked sausages, which are likely cured and ready to be eaten.",
        "label": 2
    },
    "guadarrama_NA_1597_17695304194__b.jpg": {
        "caption": "The image shows a table with a glass of beer and a few other glasses of beer on it. There are also some bottles of beer on the table.",
        "label": 2
    },
    "granada_NA_1516_24361611900__b.jpg": {
        "caption": "The image shows a plate filled with a variety of food items, including sandwiches, pastries, and other dishes. The plate is placed on a dining table.",
        "label": 2
    },
    "aiguestortes_NA_1619_28254834614__b.jpg": {
        "caption": "The image shows a table with various items on it, including a bottle of wine, a salt shaker, and a pepper shaker. There are also two glasses on the table.",
        "label": 2
    },
    "17590473384.jpg": {
        "caption": "The image shows a person holding a container filled with strawberries and other fruits. The person is standing on a hill or mountain, enjoying the view and the fresh fruit.",
        "label": 2
    },
    "granada_NA_1515_26332274000__b.jpg": {
        "caption": "The image shows a piece of meat, specifically a piece of ham, sitting on a red plate.",
        "label": 2
    },
    "picos_1_489325_1278461406946430976_image_Eb4B3bDWoAAyME_.jpg": {
        "caption": "The image shows a plate of food, which includes a piece of meat, a vegetable, and a side of fries. The plate is placed on a dining table.",
        "label": 2
    },
    "peneda_1_343086_768824470450606081_image_CqtprJlWIAENDDt.jpg": {
        "caption": "The image shows a person holding a spoon and scooping ice cream from a container.",
        "label": 2
    },
    "granada_NA_1569_48611635383__b.jpg": {
        "caption": "The image shows a plate of fried food, specifically a plate of fried sticks or fries.",
        "label": 2
    },
    "peneda_1_343086_1439580545516773386_image_E_pq3z6WUAIOa76.jpg": {
        "caption": "The image shows a bowl filled with a dark liquid, possibly a dark beverage or a sauce. The bowl is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1569_37153437220__b.jpg": {
        "caption": "The image shows a close-up of a sandwich, with a slice of ham and cheese, sitting on a table. There is also a glass of beer next to the sandwich.",
        "label": 2
    },
    "snev_NA_1410_53325043063__b.jpg": {
        "caption": "The image shows a glass of beer sitting on a table, with a man sitting next to it. The glass is filled with beer, and there is a man sitting next to it.",
        "label": 2
    },
    "granada_NA_1568_19218019881__b.jpg": {
        "caption": "The image shows a display of various types of cured meats, such as prosciutto and salame, hanging from hooks. These meats are likely being sold at a market or a deli.",
        "label": 2
    },
    "aiguestortes_NA_3934_51439017051__b.jpg": {
        "caption": "The image shows a man wearing a mask, standing in a kitchen, and preparing food. He is working on a dish, possibly making sushi, and is surrounded by various kitchen items.",
        "label": 2
    },
    "aiguestortes_NA_1553_49705308072__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of items such as meat, fries, and possibly some other dishes.",
        "label": 2
    },
    "aiguestortes_NA_3934_51438262507__b.jpg": {
        "caption": "The image shows a man wearing a mask, standing in a kitchen, and preparing food. He is cutting up fish on a cutting board.",
        "label": 2
    },
    "peneda_2_235009_1230792454150008841_image_ERSnNTtWsAA2ebT.jpg": {
        "caption": "The image shows a close-up view of a cake with a caramel sauce on top. The cake is placed on a glass plate.",
        "label": 2
    },
    "peneda_1_343086_1444644346939256837_image_FAxoXuEXIAECkcf.jpg": {
        "caption": "The image shows a woman sitting at a table with a plate of food in front of her. The plate contains a sandwich, fries, and a side of fruit. There are also wine glasses on the table, suggesting that the woman is enjoying a meal with wine.",
        "label": 2
    },
    "granada_NA_1516_24289427919__b.jpg": {
        "caption": "The image shows a table filled with a variety of food items, including bread, pastries, and other baked goods. There are also several bottles of oil and other condiments on the table.",
        "label": 2
    },
    "granada_NA_1569_31073361172__b.jpg": {
        "caption": "The image shows a cup of coffee with whipped cream on top, sitting on a wooden table.",
        "label": 2
    },
    "granada_NA_1515_31856323667__b.jpg": {
        "caption": "The image shows a bottle of wine, specifically a 2010 vintage of Ribera del Duero.",
        "label": 2
    },
    "aiguestortes_NA_3414_20678138672__b.jpg": {
        "caption": "The image shows a bowl of food, which includes meat and potatoes, along with a spoon placed inside the bowl. The bowl is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1569_36708244584__b.jpg": {
        "caption": "The image shows a plate with a variety of food items, including different types of crackers, cheese, and meat. The food is arranged in a visually appealing manner, with the crackers, cheese, and meat spread out across the plate.",
        "label": 2
    },
    "peneda_1_343086_1439582331929497606_image_E_psftaXsAYC5JT.jpg": {
        "caption": "The image shows a plate with a variety of food items, including meat, vegetables, and a knife. The plate is almost empty, and the food appears to be partially eaten.",
        "label": 2
    },
    "guadarrama_NA_1935_17708146555__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of ingredients such as noodles, vegetables, and possibly meat. The dish appears to be a mix of Asian and Western cuisine.",
        "label": 2
    },
    "snev_NA_1508_53305949084__b.jpg": {
        "caption": "The image shows a can of beer, specifically a can of Alhambra lager.",
        "label": 2
    },
    "guadarrama_NA_1935_17101667665__b.jpg": {
        "caption": "The image shows a plate of food, which includes eggs, fries, and a red sauce. The plate is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1569_48605772306__b.jpg": {
        "caption": "The image shows a plate of food, which appears to be a dish of meat, possibly ham, and possibly some other food items. The plate is placed on a table.",
        "label": 2
    },
    "aiguestortes_NA_3934_51438262692__b.jpg": {
        "caption": "The image shows a bowl of food, which appears to be a dessert or a dish with a creamy texture. The bowl is placed on a wooden table.",
        "label": 2
    },
    "guadarrama_NA_2057_26039046803__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of food items such as beans, meat, and possibly other dishes. The plate is placed on a table.",
        "label": 2
    },
    "peneda_2_183870_1547563742426062849_image_FXoNAXHUEAQp-Xh.jpg": {
        "caption": "The image shows a plate of food, which includes a slice of cake and a sauce. There are two spoons on the plate, one on the left side and the other on the right side. The plate is placed on a dining table.",
        "label": 2
    },
    "ordesa_2_188644_676046638490718208_image_CWHMlmzWIAU9hfs.jpg": {
        "caption": "The image shows a close-up view of a salad, which includes various ingredients such as lettuce, tomatoes, and fish. The salad is served on a plate, and it appears to be a healthy and appetizing meal.",
        "label": 2
    },
    "snev_NA_1410_52923518921__b.jpg": {
        "caption": "The image shows a dining table with two plates of food, including a bowl of meat and a plate of cake. The food is arranged on the table, and there is a person sitting at the table.",
        "label": 2
    },
    "granada_NA_1569_28503898666__b.jpg": {
        "caption": "The image shows a table with plates of food, including sliced fruits and vegetables. There are also forks and spoons placed on the table, ready for use.",
        "label": 2
    },
    "3999817857.jpg": {
        "caption": "The image shows a wall with a variety of red peppers and green plants growing on it. The red peppers are hanging from the wall, and there are also some green plants growing on the wall.",
        "label": 2
    },
    "granada_NA_1515_33769239460__b.jpg": {
        "caption": "The image shows a display case filled with a variety of pastries, including croissants and other baked goods.",
        "label": 2
    },
    "peneda_1_343086_1439578992995147778_image_E_ppdQmWEAMCbjk.jpg": {
        "caption": "The image shows a large bowl filled with various types of food, including meat and vegetables. The bowl is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1460_48361689447__b.jpg": {
        "caption": "The image shows a bowl filled with a variety of colorful candies, including red, orange, and yellow ones.",
        "label": 2
    },
    "snev_NA_8801_53429362979__b.jpg": {
        "caption": "The image shows a stone fountain with water flowing from it. The fountain is located in a courtyard, and there is a stone wall nearby.",
        "label": 0
    },
    "guadarrama_NA_2057_17057428750__b.jpg": {
        "caption": "The image shows a stone wall with a row of stone spikes or decorative elements on top of it. The wall is part of a castle or a similar structure.",
        "label": 0
    },
    "granada_NA_1568_16317808546__b.jpg": {
        "caption": "The image shows a beautiful garden with a stone wall, a church, and a large archway. The garden is filled with greenery, and there is a large archway that leads to the church. The scene is set against a backdrop of a cloudy sky.",
        "label": 0
    },
    "aiguestortes_NA_2094_45681782572__b.jpg": {
        "caption": "The image shows a church with a large stone building and a steeple, surrounded by a cemetery. The church is located on a hill, and there are people standing outside the church.",
        "label": 0
    },
    "4186772723.jpg": {
        "caption": "The image shows a wooden door with a window in it, located in a building. The door is open, revealing the interior of the building.",
        "label": 0
    },
    "guadarrama_NA_2057_16683150427__b.jpg": {
        "caption": "The image shows a large, old church with a tall steeple and a clock tower. The church has a Gothic architectural style, and it features a clock tower on top of it.",
        "label": 0
    },
    "granada_NA_1515_33934288300__b.jpg": {
        "caption": "The image shows a stained glass window featuring a religious figure, possibly Mary, and a baby. The window is part of a church, and it is located in a building with a large stained glass window.",
        "label": 0
    },
    "guadarrama_NA_1853_26412191927__b.jpg": {
        "caption": "The image shows a large, old building with a clock tower, which appears to be a church or a cathedral. The building is lit up at night, creating a striking contrast between the illuminated structure and the dark sky.",
        "label": 0
    },
    "granada_NA_1568_17113461026__b.jpg": {
        "caption": "The image shows a building with a beautiful stone facade, featuring a stone archway and a window. The building has a red brick exterior, and the window is open.",
        "label": 0
    },
    "6485658283.jpg": {
        "caption": "The image shows a statue of a woman, possibly a goddess, with a green color and a flower in her hand. The statue is located in a park.",
        "label": 0
    },
    "aiguestortes_NA_2798_51233361365__b.jpg": {
        "caption": "The image shows a painting or drawing of Jesus Christ on a cross, surrounded by a crowd of people.",
        "label": 0
    },
    "22379545270.jpg": {
        "caption": "The image shows a small village with stone buildings, including a church, and a mountainous landscape in the background. The village appears to be located in a valley, surrounded by hills and mountains.",
        "label": 0
    },
    "guadarrama_NA_1935_35308771196__b.jpg": {
        "caption": "The image shows a statue of a person riding a chariot, with a flag on a pole in the background. The statue is located in a park, and there are two lions nearby.",
        "label": 0
    },
    "53201876148.jpg": {
        "caption": "The image shows a man wearing a suit and tie, holding a brown box or a small statue. He is surrounded by other people, some of whom are also wearing ties. The scene appears to be a formal event or gathering.",
        "label": 0
    },
    "6046868353.jpg": {
        "caption": "The image shows a man walking down a street while carrying a large bouquet of flowers.",
        "label": 0
    },
    "granada_NA_1515_52148491198__b.jpg": {
        "caption": "The image shows a statue of a man wearing a crown, standing next to a statue of a woman wearing a veil. The man statue is wearing a red robe, and the woman statue is wearing a blue robe.",
        "label": 0
    },
    "guadarrama_NA_1935_26456342726__b.jpg": {
        "caption": "The image shows a large, old building with a clock tower, which appears to be a castle or a historical building. The building has a prominent clock tower, and it is situated in a courtyard.",
        "label": 0
    },
    "6135926408.jpg": {
        "caption": "The image shows a display of colorful blankets and scarves hanging on a wall.",
        "label": 0
    },
    "aiguestortes_NA_2527_48590905576__b.jpg": {
        "caption": "The image shows a small, old stone building with a pointed roof, which appears to be a church. The building has a stone archway, and there is a window in the middle of the building. The scene also includes a stone wall and a stone tower.",
        "label": 0
    },
    "aiguestortes_NA_4421_51209341963__b.jpg": {
        "caption": "The image shows a stone building with arches, a stone wall, and a stone bench. The building appears to be a stone ruin, and the arches and stone wall give it a historical and architectural significance.",
        "label": 0
    },
    "793071021079334912.jpg": {
        "caption": "The image shows a large, old church with a tall steeple and two pointed towers. The church is situated on a hill, and the sky is visible in the background.",
        "label": 0
    },
    "guadarrama_NA_2057_17106160801__b.jpg": {
        "caption": "The image shows a person wearing a mask and a black robe, standing in front of a silver lamp. The person is also holding a lighted candle.",
        "label": 0
    },
    "aiguestortes_NA_2310_28552823092__b.jpg": {
        "caption": "The image shows a clock tower with a bell on top of it. The tower is made of stone, and it has a bell on the top.",
        "label": 0
    },
    "granada_NA_1459_26663591204__b.jpg": {
        "caption": "The image shows two women wearing traditional Spanish dresses, or flamenco dresses, standing in front of a sign. They are both wearing red and white polka dot dresses, which are characteristic of flamenco attire. The women are also holding cell phones, possibly taking pictures or communicating with others.",
        "label": 0
    },
    "guadarrama_NA_1935_19954632351__b.jpg": {
        "caption": "The image shows a man dressed in a costume, holding a cross in his hand. He is wearing a red and black outfit, which suggests that he might be portraying a religious figure or a character from a play or a movie.",
        "label": 0
    },
    "snev_NA_8457_53039187841__b.jpg": {
        "caption": "The image shows a large clock tower, which is part of a church. The clock tower has a bell tower on top of it, and it is situated next to a building.",
        "label": 0
    },
    "guadarrama_NA_1848_38190002322__b.jpg": {
        "caption": "The image shows a young girl walking down a hallway in a building, possibly a church. She is wearing a black dress and carrying a handbag.",
        "label": 0
    },
    "guadarrama_NA_1904_23937199888__b.jpg": {
        "caption": "The image shows a close-up of a lion's head, possibly a statue or a decorative piece.",
        "label": 0
    },
    "53239514711.jpg": {
        "caption": "The image shows a church interior, featuring a large cross and a statue of Jesus. The scene also includes a group of people gathered around the statue, possibly attending a religious event or ceremony.",
        "label": 0
    },
    "aiguestortes_NA_2380_29537607625__b.jpg": {
        "caption": "The image shows a wooden statue of Jesus on a cross, with two other figures standing next to him. The statue is positioned on a wooden pole.",
        "label": 0
    },
    "guadarrama_NA_2057_26714666056__b.jpg": {
        "caption": "The image shows a view of a city from a window, with a tall building and a clock tower visible in the background.",
        "label": 0
    },
    "granada_NA_1568_17115060597__b.jpg": {
        "caption": "The image shows a beautifully decorated building with a large, ornate doorway. The doorway is adorned with intricate carvings and designs, making it an impressive architectural feature.",
        "label": 0
    },
    "16365768800.jpg": {
        "caption": "The image shows a large, old stone building, possibly a castle or a historical structure, with a staircase leading up to it. The building is situated on a hill, and there is a tree in the foreground. The scene is set against a backdrop of a beautiful sunset.",
        "label": 0
    },
    "8272830339.jpg": {
        "caption": "The image shows a statue of a woman, possibly a religious figure, standing on top of a stone structure.",
        "label": 0
    },
    "52588950876.jpg": {
        "caption": "The image shows a large, old stone building with a clock tower, which is situated in a mountainous area. The building has a castle-like appearance, and it is surrounded by trees.",
        "label": 0
    },
    "1099731005890547713.jpg": {
        "caption": "The image shows a statue of a man, possibly a warrior, standing on a pedestal. The statue is located in a mountainous area, with a mountain range in the background.",
        "label": 0
    },
    "23120543850.jpg": {
        "caption": "The image shows a painting or a mural of a group of men, possibly a religious or historical scene. The men are wearing long robes and are posed in a way that suggests they are celebrating or participating in a religious or cultural event.",
        "label": 0
    },
    "granada_NA_1568_17107538809__b.jpg": {
        "caption": "The image shows a large brick building with a tile roof, surrounded by trees and greenery. The building has a unique design, featuring a dome-like structure on top.",
        "label": 0
    },
    "34108176126.jpg": {
        "caption": "The image shows a water fountain or a water tap with a spout, located on a wall. The water is flowing out of the spout, creating a stream of water.",
        "label": 0
    },
    "aiguestortes_NA_2094_48590986456__b.jpg": {
        "caption": "The image shows a pair of stone columns, which are part of a building. The columns are adorned with intricate carvings, making them visually appealing and adding to the architectural beauty of the building.",
        "label": 0
    },
    "snev_NA_2016_53201776524__b.jpg": {
        "caption": "The image shows a group of people, including a woman and a man, sitting in a pew in a church. The church has a beautiful flower arrangement on display, which adds to the serene atmosphere of the scene.",
        "label": 0
    },
    "11118178533.jpg": {
        "caption": "The image shows a statue of Jesus, with a cross on top of it, located in a snowy mountainous area.",
        "label": 0
    },
    "aiguestortes_NA_1660_40674861983__b.jpg": {
        "caption": "The image shows a stone building with a clock tower, located in a small town. The building has a clock on its side, and there is a street light nearby. The scene also includes a stone wall and a stone archway.",
        "label": 0
    },
    "14584206836.jpg": {
        "caption": "The image shows a cityscape with a large building, possibly a church, featuring a clock tower. The building has a clock on its side, and there is a mountain in the background. The scene also includes a mountain range, adding to the picturesque view of the city.",
        "label": 0
    },
    "53248216460.jpg": {
        "caption": "The image shows a tall brick building with a clock tower, which is lit up at night. The building has a clock on its side, and it is situated next to a forest.",
        "label": 0
    },
    "guadarrama_NA_2055_20790352514__b.jpg": {
        "caption": "The image shows a group of people, likely a crowd of women, gathered together and participating in a celebration or event. They are wearing colorful clothing, and some of them are holding flags. The scene appears to be lively and festive.",
        "label": 0
    },
    "guadarrama_NA_2057_27210841739__b.jpg": {
        "caption": "The image shows a display of various woven baskets and bags, likely for sale. These baskets and bags are made from a natural material, such as wicker or rattan, and are arranged in a visually appealing manner.",
        "label": 0
    },
    "aiguestortes_NA_2798_51184816929__b.jpg": {
        "caption": "The image shows a carved stone or brick wall with a decorative design, possibly a gargoyle or a demonic-looking creature. The design is located on the wall, and it appears to be a part of the building's architecture.",
        "label": 0
    },
    "aiguestortes_NA_1660_40645789703__b.jpg": {
        "caption": "The image shows a cemetery with a large stone building, possibly a castle, in the background. The cemetery is filled with various headstones and crosses, indicating the presence of graves.",
        "label": 0
    },
    "aiguestortes_NA_2094_29399785715__b.jpg": {
        "caption": "The image shows a doorway with a carved wooden door, which is part of a building. The doorway is adorned with a carved wooden door, and there is a stone archway above it. The doorway is located in a stone building, and the door is open, revealing the interior of the building.",
        "label": 0
    },
    "guadarrama_NA_1929_45112784195__b.jpg": {
        "caption": "The image shows a large, empty courtyard with a stone building in the background. The courtyard is surrounded by stone walls, and there are several people walking around the area.",
        "label": 0
    },
    "granada_NA_1568_22013014559__b.jpg": {
        "caption": "The image shows a large building with a reflecting pool in front of it. The building has a castle-like appearance, and there are people standing around the pool.",
        "label": 0
    },
    "snev_NA_2016_53201789854__b.jpg": {
        "caption": "The image shows a statue of a woman, possibly a religious figure, sitting on a chair. The statue is adorned with candles, and it appears to be a part of a religious ceremony or event.",
        "label": 0
    },
    "aiguestortes_NA_1699_32095244204__b.jpg": {
        "caption": "The image shows a church interior, featuring a large stone archway, a stone altar, and a stone wall. The church also has a stone staircase and a stone pillar.",
        "label": 0
    },
    "aiguestortes_NA_3303_52526863777__b.jpg": {
        "caption": "The image shows a church with a tall steeple, located in a rural area. The church is situated on a hill, and there is a mountain in the background.",
        "label": 0
    },
    "aiguestortes_NA_1619_44496120751__b.jpg": {
        "caption": "The image shows a clock tower, a church steeple, and a wooden structure with a clock on it. The clock is located on the side of the wooden structure, and the church steeple is situated next to it. The scene is set against a backdrop of a mountain range.",
        "label": 0
    },
    "6824615462.jpg": {
        "caption": "The image shows a statue of a man, possibly a religious figure, wearing a long robe and a cape. The statue is made of metal and is displayed in a public setting.",
        "label": 0
    },
    "aiguestortes_NA_2380_37578942284__b.jpg": {
        "caption": "The image shows a large stone building, possibly a church, with a clock tower on top. The building is surrounded by a lush green field, and there is a mountain in the background.",
        "label": 0
    },
    "snev_NA_11342_53239885499__b.jpg": {
        "caption": "The image shows two donkeys wearing bridles and harnesses, standing next to each other.",
        "label": 0
    },
    "granada_NA_1568_16342284111__b.jpg": {
        "caption": "The image shows a couple walking under a tree, with a view of a building and a courtyard. The tree is located in front of a building, and the couple appears to be enjoying their time together.",
        "label": 0
    },
    "52895281971.jpg": {
        "caption": "The image shows a large archway or doorway, possibly part of a castle or a historical building, with a tree growing through it. The archway is open, allowing people to pass through it.",
        "label": 0
    },
    "1431523817608859648.jpg": {
        "caption": "The image shows a large, old church with a red roof, located in a mountainous area. The church is situated next to a mountain, and there is a tree in front of it.",
        "label": 0
    },
    "aiguestortes_NA_1660_47559281972__b.jpg": {
        "caption": "The image shows a large, old stone building, possibly a castle or a historical structure, with a staircase leading up to it. The building is situated on a hill, and there is a blue sky in the background.",
        "label": 0
    },
    "aiguestortes_NA_3975_44159811004__b.jpg": {
        "caption": "The image shows a large, ornate painting or mural on the wall of a building, possibly a church. The painting features a lot of people and is quite intricate.",
        "label": 0
    },
    "22960208453.jpg": {
        "caption": "The image shows a water fountain or a waterfall, with water flowing down a stone wall. The water appears to be coming from a pipe or a drain, and it is flowing down the wall.",
        "label": 0
    },
    "aiguestortes_NA_2527_29010273014__b.jpg": {
        "caption": "The image shows a large, old stone church with a tall tower and a cross on top. The church is located in a town, and there are several people standing outside of it.",
        "label": 0
    },
    "granada_NA_1515_28586554318__b.jpg": {
        "caption": "The image shows a statue of a man wearing a gold and black outfit, with a red scarf around his neck. The statue is positioned in front of a building.",
        "label": 0
    },
    "aiguestortes_NA_4421_42574829660__b.jpg": {
        "caption": "The image shows a man and a woman standing in front of a stone building, possibly a castle or a historical structure. They are posing for a picture, and the woman is wearing a backpack. The scene appears to be set in a park or an outdoor area, with the couple enjoying their time together.",
        "label": 0
    },
    "aiguestortes_NA_2142_40839339785__b.jpg": {
        "caption": "The image shows a doorway with a wooden door, located in a stone building. The doorway is adorned with a carved arch, giving it an old and historical appearance.",
        "label": 0
    },
    "guadarrama_NA_1848_31476371753__b.jpg": {
        "caption": "The image shows a statue of a man and a woman, with the man lying on the woman. The statue appears to be a religious or spiritual representation.",
        "label": 0
    },
    "53290611599.jpg": {
        "caption": "The image shows a stone fountain with a water spout, located in a courtyard. The fountain is surrounded by plants, and there are several potted plants nearby.",
        "label": 0
    },
    "1277136159051780097.jpg": {
        "caption": "The image shows a statue of Jesus, with a crown of thorns on his head, and a statue of Mary, the mother of Jesus, standing next to him.",
        "label": 0
    },
    "granada_NA_1514_47809112982__b.jpg": {
        "caption": "The image shows a beautiful garden with a fountain, a statue, and a building in the background. The garden is filled with flowers, and there is a statue of a woman in the middle of the garden. The scene is set in a park with a fountain, and the building in the background adds to the overall charm of the scene.",
        "label": 0
    },
    "53239880549.jpg": {
        "caption": "The image shows a statue of a woman, possibly a religious figure, wearing a crown and a long dress. The statue is placed in a room with a wallpapered wall.",
        "label": 0
    },
    "guadarrama_NA_2057_26369295510__b.jpg": {
        "caption": "The image shows a statue of a knight or a man in a suit of armor, standing on a pedestal.",
        "label": 0
    },
    "4168260265.jpg": {
        "caption": "The image shows a large, yellow, and brown building with a clock tower on top. The building is situated in a city, and it has a clock tower on the top of it.",
        "label": 0
    },
    "guadarrama_NA_1976_34053425796__b.jpg": {
        "caption": "The image shows a large, old castle with a tall tower, surrounded by trees. The castle appears to be in a state of disrepair, and it is situated in a wooded area.",
        "label": 0
    },
    "granada_NA_1568_16157796180__b.jpg": {
        "caption": "The image shows a close-up of a decorative stone wall with intricate carvings and designs. The wall appears to be made of stone or a similar material, and it features a pattern of interlocking shapes.",
        "label": 0
    },
    "743057352656596993.jpg": {
        "caption": "The image shows a statue of a woman, possibly Mary, placed in a cave or a rocky area. The statue is surrounded by flowers, adding a touch of beauty to the scene.",
        "label": 0
    },
    "52696667333.jpg": {
        "caption": "The image shows a church interior, featuring a large, ornate altar with a statue of a woman on it. The church has a beautifully decorated interior, with a gold and brown color scheme.",
        "label": 0
    },
    "aiguestortes_NA_2798_51233963082__b.jpg": {
        "caption": "The image shows a large, old-fashioned stone basin or vase, which is placed on a wooden floor.",
        "label": 0
    },
    "aiguestortes_NA_2142_36542348526__b.jpg": {
        "caption": "The image shows a large, old stone building with a clock tower, which is situated in a city. The building has a clock on its side, and it is located next to a street.",
        "label": 0
    },
    "granada_NA_1568_16574423694__b.jpg": {
        "caption": "The image shows a large, old building with a brown roof, which appears to be a church or a historical building. The building has a distinctive architectural style, and it is surrounded by a courtyard.",
        "label": 0
    },
    "35500462255.jpg": {
        "caption": "The image shows a clock tower with a fire burning in the background. The fire appears to be coming from the top of the building, and the clock tower is located next to a church.",
        "label": 0
    },
    "53239434086.jpg": {
        "caption": "The image shows a large, old, and possibly historical building with a castle-like appearance. The building is illuminated by sunlight, creating a warm and inviting atmosphere.",
        "label": 0
    },
    "guadarrama_NA_2057_23438961222__b.jpg": {
        "caption": "The image shows a group of old, large, and ornate buildings, which appear to be part of a castle or a similar historical structure. These buildings have steeples and are situated next to each other.",
        "label": 0
    },
    "guadarrama_NA_1935_26018395163__b.jpg": {
        "caption": "The image shows a large chandelier hanging from the ceiling of a building, with lights shining brightly. The chandelier is located in the center of the room, and it appears to be a focal point in the space.",
        "label": 0
    },
    "aiguestortes_NA_4136_51189027356__b.jpg": {
        "caption": "The image shows a church with a large steeple, located in a mountainous area. The church is situated on a hill, and the surrounding landscape includes a mountain and a forest.",
        "label": 0
    },
    "guadarrama_NA_1848_30840298192__b.jpg": {
        "caption": "The image shows a large statue of a man and a woman, possibly a couple, situated in front of a large building. The statue is positioned in front of a large clock tower, which adds to the overall grandeur of the scene.",
        "label": 0
    },
    "guadarrama_NA_1089_21378426370__b.jpg": {
        "caption": "The image shows a church interior, featuring a large, ornate wooden altar with a statue of a woman on it. The altar is part of a church's religious decorations, and the statue is a focal point in the scene.",
        "label": 0
    },
    "3716690075.jpg": {
        "caption": "The image shows a statue of a person, possibly a religious figure, standing on a rock or a pile of rocks. The statue is situated in a cloudy sky, giving it a dramatic and serene appearance.",
        "label": 0
    },
    "guadarrama_NA_1935_26032696038__b.jpg": {
        "caption": "The image shows a statue of a man and a woman, both of whom are praying. The statue is made of metal, and it appears to be a religious or spiritual representation.",
        "label": 0
    },
    "granada_NA_1515_40047551385__b.jpg": {
        "caption": "The image shows a storefront with a variety of colorful and decorative items, such as scarves, hanging outside the store. The items are displayed in an attractive manner, likely to catch the attention of passersby and potential customers.",
        "label": 0
    },
    "53239886004.jpg": {
        "caption": "The image shows a table filled with various blue and white ceramic dishes, including plates, bowls, and vases. These dishes are displayed in an appealing manner, creating an attractive and colorful presentation.",
        "label": 0
    },
    "granada_NA_1515_35885531603__b.jpg": {
        "caption": "The image shows a large building with a clock tower, a bell tower, and a steeple. The building is situated next to a forest, and there is a clock tower on top of it.",
        "label": 0
    },
    "snev_NA_5969_53299993115__b.jpg": {
        "caption": "The image shows a large, old building with a large moon in the sky above it. The building appears to be a castle or a similar structure, and the moon is rising in the background.",
        "label": 0
    },
    "granada_NA_1514_33990757160__b.jpg": {
        "caption": "The image shows a large building with a clock on its side. The building also features a statue of a woman, and there is a clock on the side of the building.",
        "label": 0
    },
    "aiguestortes_NA_2383_28030533423__b.jpg": {
        "caption": "The image shows a large brick tower, which appears to be a church tower, with a clock on its side. The tower is situated in a mountainous area, and the sky above it is cloudy.",
        "label": 0
    },
    "7938029776.jpg": {
        "caption": "The image shows a large brick building with a clock tower, which has a red brick design. The building is situated next to a church, and the clock tower is visible on the side of the building.",
        "label": 0
    },
    "1474708753014476804.jpg": {
        "caption": "The image shows a church interior, featuring a large wooden cross and a baby Jesus statue. The scene also includes a cathedral setting with a large altar and a stained glass window.",
        "label": 0
    },
    "28709860484.jpg": {
        "caption": "The image shows a man standing in front of a display of colorful blankets, possibly in a marketplace or a similar setting.",
        "label": 0
    },
    "aiguestortes_NA_1699_29186179392__b.jpg": {
        "caption": "The image shows a city street with a large stone building, possibly a church, and a clock tower. The street is lined with buildings, and there is a clock tower in the background.",
        "label": 0
    },
    "guadarrama_NA_1848_48864780916__b.jpg": {
        "caption": "The image shows a large, open building with a high ceiling, which appears to be a museum or a large hall. People are walking around the building, and there are several statues on display. The building has a grand and spacious atmosphere, with a focus on art and culture.",
        "label": 0
    },
    "guadarrama_NA_1935_34379794105__b.jpg": {
        "caption": "The image shows a large, old building with a beautiful garden in front of it. The building has a large, ornate facade, and it is surrounded by a well-maintained garden.",
        "label": 0
    },
    "guadarrama_NA_1848_31402197178__b.jpg": {
        "caption": "The image shows a large cross on top of a hill, with a church in the background. There are also two people standing in front of the cross.",
        "label": 0
    },
    "aiguestortes_NA_2142_40839342335__b.jpg": {
        "caption": "The image shows a church interior, featuring a large dome and a large painting on the wall. There are also people present in the scene, possibly attending a religious event or visiting the church.",
        "label": 0
    },
    "guadarrama_NA_2057_17032143585__b.jpg": {
        "caption": "The image shows a stained glass window, which features a person sitting on a chair and holding a sword. The stained glass window also includes a depiction of a woman, possibly a queen, and a knight.",
        "label": 0
    },
    "aiguestortes_NA_1619_35739266031__b.jpg": {
        "caption": "The image shows a church interior, featuring a large wooden pew, a cross, and a stained glass window. The church has a wooden floor and is filled with wooden pews.",
        "label": 0
    },
    "granada_NA_1568_17657696554__b.jpg": {
        "caption": "The image shows a large building with a courtyard, a fountain, and a statue. It also features a group of people walking around the area, possibly tourists exploring the historical site.",
        "label": 0
    },
    "guadarrama_NA_1773_23588115846__b.jpg": {
        "caption": "The image shows a cityscape with a large cathedral and a few other buildings in the background. The cathedral has a dome, and there are trees in the foreground.",
        "label": 0
    },
    "guadarrama_NA_1976_49556302656__b.jpg": {
        "caption": "The image shows a large, old castle or fortress, with a tall tower and a steeple. The castle is situated on a hill, overlooking the surrounding landscape.",
        "label": 0
    },
    "snev_NA_11342_53239819483__b.jpg": {
        "caption": "The image shows a display of various vases and plates, likely in a store or a museum. The vases and plates are placed on a table or a shelf, showcasing their different designs and colors.",
        "label": 0
    },
    "15599546104.jpg": {
        "caption": "The image shows a group of people walking across a snow-covered slope, likely on a ski resort. They are carrying a cake, which suggests that they might be celebrating a special occasion or event.",
        "label": 4
    },
    "aiguestortes_NA_1618_46828346005__b.jpg": {
        "caption": "The image shows a group of people in blue kayaks, paddling together on a body of water.",
        "label": 4
    },
    "aiguestortes_NA_324_50383883947__o.jpg": {
        "caption": "The image shows a group of people hiking up a rocky hillside, carrying backpacks and walking on a rocky trail.",
        "label": 4
    },
    "aiguestortes_NA_4459_16837125793__b.jpg": {
        "caption": "The image shows a man wearing a wetsuit and a helmet, standing in a river with a paddle. He is holding a paddle and appears to be enjoying his time in the water.",
        "label": 4
    },
    "5359924491.jpg": {
        "caption": "The image shows a snowboarder performing a trick in the air, likely after launching off a ramp. The snowboarder is in the middle of the trick, and there are several people watching the performance.",
        "label": 4
    },
    "6867504322.jpg": {
        "caption": "The image shows a pair of skis, with one ski on the ground and the other one attached to a person's feet. The person is standing on the skis, and the skis are placed on a snowy surface.",
        "label": 4
    },
    "aiguestortes_NA_1201_48759714838__b.jpg": {
        "caption": "The image shows a group of people standing on a snowy mountain, holding up their flags. They are likely enjoying a skiing or snowboarding trip, and the flags may represent their country or a specific group they belong to.",
        "label": 4
    },
    "52906887848.jpg": {
        "caption": "The image shows a person riding a bicycle on a dirt road, surrounded by trees.",
        "label": 4
    },
    "guadarrama_NA_1855_27591509251__b.jpg": {
        "caption": "The image shows a man playing golf on a lush green course. He is in the process of taking a swing at a golf ball, using a golf club to make contact with the ball.",
        "label": 4
    },
    "28452350043.jpg": {
        "caption": "The image shows a person standing on top of a mountain, taking a picture of the surrounding landscape.",
        "label": 4
    },
    "52825600693.jpg": {
        "caption": "The image shows a group of people walking up a hill or mountain, likely participating in a hiking or outdoor activity.",
        "label": 4
    },
    "snev_NA_3355_52977386994__b.jpg": {
        "caption": "The image shows a woman walking down a dirt path or trail, surrounded by a natural environment. She is wearing a white hat and carrying a backpack.",
        "label": 4
    },
    "8736198620.jpg": {
        "caption": "The image shows a group of people riding bicycles on a road, with a mountain in the background.",
        "label": 4
    },
    "granada_995012_995012_579253919345414144_image_CAnsXpqWwAAbtkT.jpg": {
        "caption": "The image shows a person, possibly a woman, snowboarding on a snow-covered slope.",
        "label": 4
    },
    "snev_NA_2014_52953449856__b.jpg": {
        "caption": "The image shows a man riding a bicycle on a dirt road, with a mountain in the background.",
        "label": 4
    },
    "5456589479.jpg": {
        "caption": "The image shows three people riding horses in a grassy field.",
        "label": 4
    },
    "5809060959.jpg": {
        "caption": "The image shows a ski slope with ski lifts and skiers on the snow-covered hill.",
        "label": 4
    },
    "7548591326.jpg": {
        "caption": "The image shows a group of people riding bicycles down a road.",
        "label": 4
    },
    "6819505776.jpg": {
        "caption": "The image shows a man wearing a helmet and a jacket, standing on a staircase. He appears to be a snowboarder, possibly taking a break or preparing to go back down the mountain.",
        "label": 4
    },
    "5060576384.jpg": {
        "caption": "The image shows a ski lift carrying people up a snowy mountain.",
        "label": 4
    },
    "snev_NA_1995_53522665820__b.jpg": {
        "caption": "The image shows a person wearing a parachute, flying through the air while being pulled by a parachute cord.",
        "label": 4
    },
    "aiguestortes_NA_1125_27099593955__b.jpg": {
        "caption": "The image shows a person wearing a backpack and a helmet, riding a snowboard down a snow-covered slope.",
        "label": 4
    },
    "aiguestortes_NA_1126_51684805793__b.jpg": {
        "caption": "The image shows a group of people standing on a rocky hill, holding a flag. They are posing for a picture, and the scene appears to be a mix of adventure and patriotism.",
        "label": 4
    },
    "8773404486.jpg": {
        "caption": "The image shows two snowboards lying on the ground, placed next to each other.",
        "label": 4
    },
    "aiguestortes_NA_1122_49351377802__b.jpg": {
        "caption": "The image shows a man wearing a yellow jacket and skiing on a snow-covered slope. He is holding two ski poles while skiing.",
        "label": 4
    },
    "8736198412.jpg": {
        "caption": "The image shows a man and a woman standing next to their bicycles, posing for a picture. They are also standing next to a sign, which could be a road sign or a sign indicating the location.",
        "label": 4
    },
    "aiguestortes_NA_3014_28259335960__b.jpg": {
        "caption": "The image shows a group of people walking along a path near a body of water, such as a lake or a river. They are carrying backpacks and walking on a dirt trail. The scene appears to be a mix of a hiking trail and a beach, with the presence of the water and the people's attire suggesting a more adventurous outdoor activity.",
        "label": 4
    },
    "granada_1027311_1027311_1594443186122133504_image_FiCZn1tWAAAyfZj.jpg": {
        "caption": "The image shows a man standing next to his bicycle, which is parked on a rocky hillside. The man is wearing a backpack and appears to be a mountain biker.",
        "label": 4
    },
    "guadarrama_1_407382_1036200818981134336_image_DmFTIpxXsAAd2D1.jpg": {
        "caption": "The image shows a man wearing a helmet and sunglasses, standing next to his bicycle. The man is also wearing a backpack. The scene takes place in a field, with a mountain in the background.",
        "label": 4
    },
    "9604720821.jpg": {
        "caption": "The image shows a man standing on a mountain, holding a bicycle. He is wearing a backpack and appears to be preparing to ride the bike on the mountain.",
        "label": 4
    },
    "464119890.jpg": {
        "caption": "The image shows a group of people standing together in the snow, wearing winter clothing and gear. They are likely enjoying a skiing or snowboarding trip, as they are equipped with the necessary gear.",
        "label": 4
    },
    "aiguestortes_NA_4459_17524873715__b.jpg": {
        "caption": "The image shows a person, likely a woman, wearing a wetsuit and standing on a paddleboard in the water. She is holding a paddle and appears to be enjoying her time on the water.",
        "label": 4
    },
    "5312671045.jpg": {
        "caption": "The image shows a man jumping in the air, wearing a black jacket and black pants. He is performing a jump, possibly for exercise or as part of a sports activity.",
        "label": 4
    },
    "32713984264.jpg": {
        "caption": "The image shows a group of people walking on a road, with a backpack on one of the people. The backpack has a bag of food in it, and it appears to be a hiking or outdoor activity.",
        "label": 4
    },
    "16437365613.jpg": {
        "caption": "The image shows a man walking along a river, with a waterfall in the background. The man is wearing a blue shirt and appears to be enjoying the natural surroundings.",
        "label": 4
    },
    "17172171200.jpg": {
        "caption": "The image shows a snowy mountain with a large group of people skiing and snowboarding on the slopes.",
        "label": 4
    },
    "8060287903.jpg": {
        "caption": "The image shows a group of people, likely hikers, sitting on a rocky hillside or a rocky outcropping. They are wearing backpacks and appear to be taking a break from their hike.",
        "label": 4
    },
    "6755881881.jpg": {
        "caption": "The image shows a snowy mountain with skiers and snowboarders enjoying the slopes.",
        "label": 4
    },
    "8417220732.jpg": {
        "caption": "The image shows a man and a woman, both wearing helmets, sitting in a car. The man is wearing a red and white helmet, while the woman is wearing a black helmet. The scene is captured through a car's rearview mirror.",
        "label": 4
    },
    "aiguestortes_NA_4459_25443842564__b.jpg": {
        "caption": "The image shows a person, likely a young man, wearing a wetsuit and paddling on a river using a paddle. The person is holding a paddle while navigating the water.",
        "label": 4
    },
    "5610806591.jpg": {
        "caption": "The image shows a snowboard leaning against a tree, with a red jacket hanging nearby.",
        "label": 4
    },
    "4531160205.jpg": {
        "caption": "The image shows a person standing on a hillside, overlooking a valley below. The person is wearing a backpack and appears to be enjoying the view.",
        "label": 4
    },
    "8668667497.jpg": {
        "caption": "The image shows a man sitting on a rocky hillside, with his dog nearby. The man is wearing a hat and appears to be enjoying the outdoors with his canine companion.",
        "label": 4
    },
    "16025194702.jpg": {
        "caption": "The image shows a group of people, including a man and two children, standing on a snow-covered slope. They are all wearing ski gear and are likely enjoying a skiing activity together.",
        "label": 4
    },
    "aiguestortes_NA_4460_29391709956__b.jpg": {
        "caption": "The image shows a group of people, including children, wearing life jackets and paddling in canoes or kayaks on a river.",
        "label": 4
    },
    "15788431654.jpg": {
        "caption": "The image shows a person skiing down a snow-covered slope, with a mountain in the background.",
        "label": 4
    },
    "5398378453.jpg": {
        "caption": "The image shows a group of people walking through the woods, with some of them wearing backpacks. They are likely hikers or outdoor enthusiasts enjoying a day out in nature.",
        "label": 4
    },
    "2260493241.jpg": {
        "caption": "The image shows a man snowboarding down a snow-covered slope.",
        "label": 4
    },
    "aiguestortes_NA_1050_18618052829__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a valley and a river running through it. The scene is set against a backdrop of mountains, and the valley is filled with trees. The image captures the serene and picturesque beauty of the natural environment.",
        "label": 3
    },
    "snev_NA_1029_53590143179__b.jpg": {
        "caption": "The image shows a mountain range with a cloudy sky in the background. There are trees in the foreground, and a couple of birds can be seen perched on the branches.",
        "label": 3
    },
    "aiguestortes_NA_1195_49217024778__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a clear blue sky. The scene includes a mountain range, a valley, and a road running through the area.",
        "label": 3
    },
    "12799412333.jpg": {
        "caption": "The image shows a beautiful sunset, with the sun setting behind a hill and a wind farm in the foreground.",
        "label": 3
    },
    "27135893030.jpg": {
        "caption": "The image shows a tree growing in a rocky area, with a mountain in the background. The tree is surrounded by rocks, and it appears to be growing out of a rocky hillside.",
        "label": 3
    },
    "15353004604.jpg": {
        "caption": "The image shows a dirt trail surrounded by trees and bushes. The trail is lined with rocks, and it appears to be a path through the woods.",
        "label": 3
    },
    "11209657266.jpg": {
        "caption": "The image shows a mountainous area with a rocky landscape, a rocky hillside, and a rocky mountain. The scene also features a cloudy sky, adding to the overall atmosphere of the location.",
        "label": 3
    },
    "aiguestortes_NA_1049_33584839821__b.jpg": {
        "caption": "The image shows a snow-covered mountain with a stream of water flowing through it. The stream appears to be frozen, and the surrounding area is covered in snow.",
        "label": 3
    },
    "6975890629.jpg": {
        "caption": "The image shows a snowy mountain range with a mountain peak in the background. The scene is captured from a vantage point, possibly from a higher elevation or a distance.",
        "label": 3
    },
    "8858979425.jpg": {
        "caption": "The image shows a mountain range with snow-capped peaks, and it appears to be a sunny day.",
        "label": 3
    },
    "aiguestortes_NA_3469_52205018429__b.jpg": {
        "caption": "The image shows a beautiful blue lake surrounded by trees and mountains. The scene is serene and picturesque, with the lake reflecting the natural landscape.",
        "label": 3
    },
    "27962492640.jpg": {
        "caption": "The image shows a lush green hillside with a forest of trees. The trees are tall and appear to be growing in a row, creating a picturesque scene.",
        "label": 3
    },
    "8564209455.jpg": {
        "caption": "The image shows a mountainous area with a large rocky hillside, a forest, and a mountain. The scene is set against a backdrop of a mountain, and the landscape is characterized by the presence of trees and the rocky terrain.",
        "label": 3
    },
    "24485487524.jpg": {
        "caption": "The image shows a large tree with a bare limb, surrounded by a forest of trees. The tree appears to be dead, and the sky can be seen through the branches.",
        "label": 3
    },
    "6321396295.jpg": {
        "caption": "The image shows a forest with many trees, a mountain in the background, and a snowy mountain peak. The scene is set in a sunny day, and the trees are lush and green.",
        "label": 3
    },
    "31345675694.jpg": {
        "caption": "The image shows a rocky, mountainous area with a dirt road running through it. The road is surrounded by a rocky landscape, and there is a car driving on the road.",
        "label": 3
    },
    "snev_NA_1799_52998787588__b.jpg": {
        "caption": "The image shows a beautiful mountainous area with a clear blue sky above. The scene is set on a hillside, and the landscape is filled with trees, creating a serene and picturesque environment.",
        "label": 3
    },
    "4735368615.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a lush green hillside, a valley, and a mountain range. The scene is set against a blue sky, and the mountains are covered in snow.",
        "label": 3
    },
    "aiguestortes_NA_1194_29909772915__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a large body of water, such as a lake, situated in the middle of the scene. The mountains are covered with lush greenery, and the sky is blue, creating a serene and picturesque view.",
        "label": 3
    },
    "aiguestortes_NA_1268_44063678315__b.jpg": {
        "caption": "The image shows a serene scene of a river flowing through a valley, surrounded by mountains. The river reflects the beautiful landscape, creating a picturesque view.",
        "label": 3
    },
    "28835199964.jpg": {
        "caption": "The image shows a beautiful sunset over a mountain range, with the sun peeking through the clouds. The scene is set against a backdrop of mountains, and the sunlight creates a stunning visual effect.",
        "label": 3
    },
    "6851223538.jpg": {
        "caption": "The image shows a wooden bridge or pier over a body of water, such as a lake or a river. The bridge is surrounded by a natural environment, with trees and possibly a forest nearby. The scene captures the essence of a serene and picturesque location.",
        "label": 3
    },
    "25497852243.jpg": {
        "caption": "The image shows a waterfall or a waterway with a rocky cliff, surrounded by snow and ice. The waterway appears to be flowing down the cliff, creating a picturesque scene.",
        "label": 3
    },
    "29779331571.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a rocky hillside and a mountain range in the background. The scene is set against a clear blue sky, and the mountain range appears to be in the distance.",
        "label": 3
    },
    "snev_NA_3364_52619871045__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a snow-covered mountain and a sunset in the background. The sun is setting behind the mountain, creating a stunning view.",
        "label": 3
    },
    "granada_977255_977255_582481027362373632_image_CBVjWZgWoAAdLHk.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a snow-covered mountain in the background. The scene is set in a valley, and the mountain range is visible in the distance. The valley is filled with greenery, and the overall atmosphere is serene and picturesque.",
        "label": 3
    },
    "8995514772.jpg": {
        "caption": "The image shows a snowy mountain landscape with a cloudy sky. The mountain is covered in snow, and there are trees in the foreground. The scene is set against a backdrop of a cloudy sky, which adds to the overall atmosphere of the image.",
        "label": 3
    },
    "5718635204.jpg": {
        "caption": "The image shows a full moon in the sky, with a clear blue sky in the background.",
        "label": 3
    },
    "11045590353.jpg": {
        "caption": "The image shows a mountainous area with a cloudy sky above it. The sky is filled with clouds, and the mountains are covered in a layer of clouds. The scene is quite dramatic and captures the beauty of the landscape.",
        "label": 3
    },
    "5377887244.jpg": {
        "caption": "The image shows a beautiful mountain range with snow-covered peaks and a sunset in the background. The sun is setting behind the mountain range, casting a warm glow on the scene.",
        "label": 3
    },
    "snev_NA_2673_52984239869__b.jpg": {
        "caption": "The image shows a beautiful mountain lake, surrounded by a lush green forest. The serene scene is accentuated by the presence of a large mountain in the background.",
        "label": 3
    },
    "9412614255.jpg": {
        "caption": "The image shows a large field with a mountain in the background. The field is filled with wooden boxes, which are likely honey beehives.",
        "label": 3
    },
    "389329615.jpg": {
        "caption": "The image shows a beautiful sunset, with the sun setting behind a cloudy sky. The sky is filled with clouds, and the sun is visible in the background.",
        "label": 3
    },
    "14178069600.jpg": {
        "caption": "The image shows a mountainous area with a rocky landscape, featuring a rocky cliff and a mountain range. The scene also includes a rocky canyon and a rocky hillside.",
        "label": 3
    },
    "11380973825.jpg": {
        "caption": "The image shows a small stream or river flowing through a forest. The stream is surrounded by trees and rocks, creating a serene and natural environment.",
        "label": 3
    },
    "aiguestortes_NA_1634_50257080848__b.jpg": {
        "caption": "The image shows a waterfall, with water cascading down a rocky cliff. The waterfall is surrounded by lush greenery, creating a picturesque scene.",
        "label": 3
    },
    "aiguestortes_NA_1634_51414708962__b.jpg": {
        "caption": "The image shows a beautiful mountain landscape with a lush green field, a forest, and a mountain range in the background. The scene is serene and picturesque, with the sun shining on the landscape.",
        "label": 3
    },
    "snev_NA_3360_53003379722__b.jpg": {
        "caption": "The image shows a beautiful mountain valley with a green hillside and a river flowing through it. The valley is surrounded by mountains, and the scene is set against a blue sky.",
        "label": 3
    },
    "aiguestortes_NA_1343_36572134772__b.jpg": {
        "caption": "The image shows a beautiful, lush green field with a stream of water flowing through it. The field is surrounded by trees, creating a serene and picturesque scene.",
        "label": 3
    },
    "8952667967.jpg": {
        "caption": "The image shows a snow-covered mountain with a waterway running through it. The waterway is surrounded by snow and ice, creating a picturesque scene.",
        "label": 3
    },
    "29587381803.jpg": {
        "caption": "The image shows a large, open field with a cloudy sky above it. The field is covered in dry grass, and there is a building in the distance. The scene appears to be a mix of a desert landscape and a rural setting.",
        "label": 3
    },
    "aiguestortes_NA_1131_52232179920__b.jpg": {
        "caption": "The image shows a river with rocks and boulders in it, flowing through a forest. The river appears to be orange, which is an unusual color for a river.",
        "label": 3
    },
    "10296965684.jpg": {
        "caption": "The image shows a beautiful mountainous area with a winding road, surrounded by trees and mountains. The road is located in a valley, and the scene is set against a backdrop of mountains.",
        "label": 3
    },
    "aiguestortes_NA_1194_22150127588__b.jpg": {
        "caption": "The image shows a beautiful mountain lake, surrounded by a lush green forest. The lake is a deep blue color, and it appears to be a serene and picturesque scene.",
        "label": 3
    },
    "aiguestortes_NA_1049_50075464241__b.jpg": {
        "caption": "The image shows a waterfall, with water cascading down a rocky cliff. The waterfall is surrounded by a lush green forest, creating a picturesque scene.",
        "label": 3
    },
    "8698830822.jpg": {
        "caption": "The image shows a river flowing through a mountainous area, with a beautiful view of the surrounding landscape.",
        "label": 3
    },
    "20819737520.jpg": {
        "caption": "The image shows a beautiful sunset over a mountain range, with the sun setting behind the mountains. The scene is captured from a high vantage point, providing a stunning view of the sunset and the surrounding landscape.",
        "label": 3
    },
    "aiguestortes_NA_4718_26783101944__b.jpg": {
        "caption": "The image shows a river flowing through a mountainous area, with a rocky cliff and a waterfall nearby. The river is surrounded by lush greenery, and the scene is picturesque and serene.",
        "label": 3
    },
    "9669965355.jpg": {
        "caption": "The image shows a close-up of a flower, with a focus on its stalk and petals. The flower is in a field, and there is a green background.",
        "label": 1
    },
    "aiguestortes_NA_1220_52184093823__b.jpg": {
        "caption": "The image shows a butterfly perched on a purple flower.",
        "label": 1
    },
    "snev_NA_3263_52979330553__b.jpg": {
        "caption": "The image shows a small bird perched on a rocky surface, possibly a cliff or a rock.",
        "label": 1
    },
    "aiguestortes_NA_1849_18694507532__b.jpg": {
        "caption": "The image shows a beaver sitting on a rock or a tree stump, surrounded by greenery.",
        "label": 1
    },
    "guadarrama_NA_1041_22448817476__b.jpg": {
        "caption": "The image shows a horse grazing on grass in a lush green field.",
        "label": 1
    },
    "17637449584.jpg": {
        "caption": "The image shows a close-up of a bunch of red roses, with some of them appearing to be dying.",
        "label": 1
    },
    "9079710662.jpg": {
        "caption": "The image shows a blue butterfly perched on a stalk of grass.",
        "label": 1
    },
    "14697332068.jpg": {
        "caption": "The image shows a mountainous area with a large animal, possibly a moose, standing on a hill. The animal is looking over the top of the hill, and the scene is captured from a high vantage point.",
        "label": 1
    },
    "peneda_1_343086_1440235577446522892_image_E_y-kxYUYAkdppN.jpg": {
        "caption": "The image shows a close-up of a lizard, specifically a green and black lizard, sitting on a rock.",
        "label": 1
    },
    "peneda_2_235009_883430465809645569_image_DEKTTfrXkAApnv3.jpg": {
        "caption": "The image shows a close-up of a flower, specifically a purple and yellow flower, with its petals and stamen clearly visible.",
        "label": 1
    },
    "ordesa_2_188644_1535899098942930945_image_FVCcDBFWUAAQfsW.jpg": {
        "caption": "The image shows a close-up of a flower, possibly a purple one, growing in a field of grass.",
        "label": 1
    },
    "aiguestortes_NA_1359_50263492162__b.jpg": {
        "caption": "The image shows a butterfly perched on a flower, with its wings spread out.",
        "label": 1
    },
    "picos_1_326635_1508394657666981888_image_FO7k3loXMAU_FdJ.jpg": {
        "caption": "The image shows a close-up of a flower, possibly a daisy, growing in a dirt field.",
        "label": 1
    },
    "picos_1_320358_1019524093631254528_image_DiYTugKX4AEV1Qa.jpg": {
        "caption": "The image shows a beautiful garden with a variety of flowers, including pink flowers. The garden is situated in a mountainous area, with a house nearby. The scene also features a rocky cliff, adding to the natural beauty of the location.",
        "label": 1
    },
    "aiguestortes_NA_1334_37283525342__b.jpg": {
        "caption": "The image shows a green field with two horses grazing on the grass. The horses are standing next to each other, and the scene is set against a backdrop of mountains.",
        "label": 1
    },
    "aiguestortes_NA_2006_42974922830__b.jpg": {
        "caption": "The image shows a mushroom growing out of the ground, with its cap and stem visible.",
        "label": 1
    },
    "8367414681.jpg": {
        "caption": "The image shows a cow standing on a snow-covered hill, with a beautiful mountain range in the background.",
        "label": 1
    },
    "snev_NA_646_53623255664__b.jpg": {
        "caption": "The image shows a bird flying in the sky, with another bird flying nearby. The scene takes place on a clear blue day.",
        "label": 1
    },
    "snev_NA_3361_52978796893__b.jpg": {
        "caption": "The image shows two purple flowers, or purple flowers with yellow centers, growing in a field.",
        "label": 1
    },
    "aiguestortes_NA_1334_50033463172__b.jpg": {
        "caption": "The image shows two cows, one adult and one young, standing in a grassy field. The young cow is drinking water from a puddle, while the adult cow is standing nearby. The scene takes place in a mountainous area, with a beautiful mountain range in the background.",
        "label": 1
    },
    "6701071451.jpg": {
        "caption": "The image shows a small bird perched on a branch, surrounded by dry grass and twigs.",
        "label": 1
    },
    "13664654425.jpg": {
        "caption": "The image shows a snowy mountain landscape with two cows standing in the snow.",
        "label": 1
    },
    "ordesa_5_310933_1534284156351438849_image_FUrfTg2WUAI63Vr.jpg": {
        "caption": "The image shows a butterfly perched on a pink flower.",
        "label": 1
    },
    "snev_NA_2188_53522395938__b.jpg": {
        "caption": "The image shows a large blue heron standing in a body of water, such as a lake or a river.",
        "label": 1
    },
    "33703008213.jpg": {
        "caption": "The image shows a close-up view of a flower, specifically a yellow rose, with its petals and stamen clearly visible.",
        "label": 1
    },
    "5038500204.jpg": {
        "caption": "The image shows a man standing in a field with a large herd of sheep surrounding him. The man is holding a stick, possibly a shepherd's staff, and is standing near the sheep. The scene captures the interaction between the man and the sheep, as well as the vast number of sheep in the field.",
        "label": 1
    },
    "aiguestortes_NA_1049_51457629770__b.jpg": {
        "caption": "The image shows a lizard, specifically a green and brown striped lizard, sitting on a rock.",
        "label": 1
    },
    "1233851581.jpg": {
        "caption": "The image shows a close-up view of a plant with green leaves and a cluster of green flowers. The plant has a fern-like appearance, and the flowers are surrounded by green leaves.",
        "label": 1
    },
    "31479224925.jpg": {
        "caption": "The image shows a leaf with water droplets on it, possibly from a recent rain. The leaf is hanging from a tree, and it appears to be a yellow leaf.",
        "label": 1
    },
    "guadarrama_NA_1448_42693046515__b.jpg": {
        "caption": "The image shows a close-up of a brown and black frog sitting on a rock.",
        "label": 1
    },
    "snev_NA_2197_52965863852__b.jpg": {
        "caption": "The image shows a butterfly perched on a purple flower.",
        "label": 1
    },
    "ordesa_5_299870_1270387163105017859_image_EaFSXl6WAAIXLb-.jpg": {
        "caption": "The image shows a brown bear sitting on a rock in a grassy field.",
        "label": 1
    },
    "8054589889.jpg": {
        "caption": "The image shows a close-up of a flower, focusing on its petals and the surrounding greenery.",
        "label": 1
    },
    "guadarrama_1_251283_1449281894286340100_image_FBziLSsXsAEgCwj.jpg": {
        "caption": "The image shows a mushroom growing out of the ground in a grassy field.",
        "label": 1
    },
    "6329896558.jpg": {
        "caption": "The image shows a mushroom growing out of the snow, surrounded by a snowy landscape.",
        "label": 1
    },
    "15440023779.jpg": {
        "caption": "The image shows a ram, which is a type of mountain goat, standing on a rocky hillside.",
        "label": 1
    },
    "8190678347.jpg": {
        "caption": "The image shows a close-up view of a fruit, which appears to be a cherry or a red berry, with its stem still attached. The fruit is displayed in a natural setting, possibly on a tree or a bush.",
        "label": 1
    },
    "guadarrama_NA_1489_19970898092__b.jpg": {
        "caption": "The image shows a single rose with a drop of water on it, sitting in a garden setting.",
        "label": 1
    },
    "guadarrama_1_407382_1064123138412343298_image_DsSGTs4XQAEzgrm.jpg": {
        "caption": "The image shows two red mushrooms growing in the dirt.",
        "label": 1
    },
    "aiguestortes_NA_4458_49816410521__b.jpg": {
        "caption": "The image shows a close-up of a plant with a flower and a seed pod. The plant has a seed pod on it, and there are also some dandelions in the scene.",
        "label": 1
    },
    "aiguestortes_NA_1050_31015439863__b.jpg": {
        "caption": "The image shows a close-up of a small purple flower growing out of a rocky area.",
        "label": 1
    },
    "snev_NA_3361_52978276342__b.jpg": {
        "caption": "The image shows a group of horned animals, specifically mountain goats, sitting on a rocky hillside.",
        "label": 1
    },
    "guadarrama_NA_1523_52350216431__b.jpg": {
        "caption": "The image shows a close-up of a grasshopper's head, with its antennae and eyes visible.",
        "label": 1
    },
    "snev_NA_1507_53130721898__b.jpg": {
        "caption": "The image shows a garden with a variety of flowers and plants, including purple flowers and a field of wildflowers. The garden is filled with different types of flowers, creating a vibrant and colorful scene.",
        "label": 1
    },
    "14350896135.jpg": {
        "caption": "The image shows a bird, specifically a brown and white bird, standing on a rock in a body of water.",
        "label": 1
    },
    "aiguestortes_NA_1647_28229580181__b.jpg": {
        "caption": "The image shows a small bird perched on a tall, thin, and skinny stalk of grass.",
        "label": 1
    },
    "6341224124.jpg": {
        "caption": "The image shows a tree filled with white flowers, which are likely cherry blossoms. The tree is in full bloom, and the flowers are scattered throughout the tree.",
        "label": 1
    },
    "snev_NA_1603_53691971070__b.jpg": {
        "caption": "The image shows a close-up of a butterfly perched on a tall grass stalk.",
        "label": 1
    },
    "4138830218.jpg": {
        "caption": "The image shows a flower pot with a plant in it, placed on a window sill. The plant is growing in a window box, and the window is made of stone.",
        "label": 5
    },
    "1449088106.jpg": {
        "caption": "The image shows a large city with a lot of buildings, including apartment buildings and a large white building. The city is situated on a hill, and the buildings are spread out across the landscape.",
        "label": 5
    },
    "5413976599.jpg": {
        "caption": "The image shows a woman wearing a pink hat and a black jacket, standing outside in the snow. She is smiling and appears to be enjoying the winter weather.",
        "label": 5
    },
    "53736356798_d4d1225f21_k.jpg": {
        "caption": "The image shows a street scene with a white building, a white house, and a white building with a balcony. The street is lined with white buildings, and there is a bench on the sidewalk. The scene also includes a street light and a lamp post.",
        "label": 5
    },
    "30602368624.jpg": {
        "caption": "The image shows a rooftop with two chimneys, which are part of a building. The chimneys are located on the roof, and there is a mountain in the background.",
        "label": 5
    },
    "9149270205.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a cobblestone or stone street. The alleyway is lined with potted plants, creating a pleasant and inviting atmosphere.",
        "label": 5
    },
    "2760968254.jpg": {
        "caption": "The image shows a street view of a building with a balcony and potted plants. The building is located in a small town, and the street appears to be empty.",
        "label": 5
    },
    "11013353783.jpg": {
        "caption": "The image shows a white building with a balcony and a flower box. The building has a white facade, and there are flowers in pots outside the building.",
        "label": 5
    },
    "snev_NA_4340_52696815546__b.jpg": {
        "caption": "The image shows a white building with a green door, located in a small village. The building has a chimney, and there are potted plants on the roof. The scene also includes a street with a few houses and a mountain in the background.",
        "label": 5
    },
    "6654114971.jpg": {
        "caption": "The image shows a large, lush green field with a white building in the background. The field is located next to a house, and there is a mountain in the distance.",
        "label": 5
    },
    "5374576198.jpg": {
        "caption": "The image shows a snowy mountain with a town or city located at the base of the mountain. The town is surrounded by a large mountain, and the snow-covered landscape creates a picturesque scene.",
        "label": 5
    },
    "429538222.jpg": {
        "caption": "The image shows a mountain village with a group of houses and chimneys. The village is situated on a hillside, and the houses are built close to each other.",
        "label": 5
    },
    "29301256554.jpg": {
        "caption": "The image shows a view of a building with a stone wall and a stone tower. The building is situated next to a stone wall, and there is a window on the side of the building. The scene also includes a balcony and a potted plant.",
        "label": 5
    },
    "20333169184.jpg": {
        "caption": "The image shows a building with many potted plants and flowers hanging from the balcony. The plants are in various sizes and colors, creating a vibrant and lively atmosphere.",
        "label": 5
    },
    "6902305517.jpg": {
        "caption": "The image shows a view of a mountainous area with a large white building, possibly a church, situated on top of a hill. The building is surrounded by a beautiful landscape, including a mountain range and a valley. The scene also features a clock tower, adding to the architectural interest of the area.",
        "label": 5
    },
    "5834124185.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a stone wall on one side and a stone building on the other. The alleyway is surrounded by stone walls, and it appears to be a dirt road.",
        "label": 5
    },
    "5478209759.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a staircase leading up to the buildings. The alleyway is lined with clothes hanging on a line, creating a unique and interesting scene.",
        "label": 5
    },
    "1497165295.jpg": {
        "caption": "The image shows two women standing on a balcony, looking out over the city.",
        "label": 5
    },
    "35412965651_a62b92584e_k.jpg": {
        "caption": "The image shows a street scene with a building featuring a flower-filled balcony. The balcony is adorned with potted plants, and there are several potted plants placed around the building. The scene also includes a table with items on it, possibly for sale or display.",
        "label": 5
    },
    "16634794779.jpg": {
        "caption": "The image shows a group of people walking down a street in a mountainous area.",
        "label": 5
    },
    "24974679470.jpg": {
        "caption": "The image shows a beautiful mountainous area with a town nestled in the valley below. The town is surrounded by a lush green forest, and the sky is visible above the town.",
        "label": 5
    },
    "16677294756_846b689733_k.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a vine-covered arbor and a grapevine growing on the side of one of the buildings. The alleyway is surrounded by buildings, and there is a clock on the side of one of the buildings.",
        "label": 5
    },
    "31509457234.jpg": {
        "caption": "The image shows a group of people, including children, playing outside in a wooded area. They are standing on a rooftop, possibly a house or a building, and enjoying their time together.",
        "label": 5
    },
    "770991235.jpg": {
        "caption": "The image shows a white building with a wooden door, a window, and a cat sitting on the window sill. The building appears to be a house or a small building with a wooden roof.",
        "label": 5
    },
    "9148456413.jpg": {
        "caption": "The image shows a doorway with a light fixture above it, possibly a street light. The doorway is located next to a building, and the light fixture is casting a shadow on the wall.",
        "label": 5
    },
    "12196057413.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a doorway leading to a building. The alleyway is dark and appears to be a passage between the buildings.",
        "label": 5
    },
    "31135205313.jpg": {
        "caption": "The image shows a large building with a green roof, surrounded by a snowy mountain landscape. The building is located near the top of the mountain, and the sun is setting, creating a beautiful and serene atmosphere.",
        "label": 5
    },
    "15619313247.jpg": {
        "caption": "The image shows a person sitting on a bench in a courtyard, possibly in a village or a small town. The person is wearing a blue jacket and appears to be enjoying the outdoor setting.",
        "label": 5
    },
    "30123504903.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a variety of flowers and plants lining the sides of the alley. The alley is also adorned with a light fixture, adding to the overall aesthetic of the area.",
        "label": 5
    },
    "27804011820.jpg": {
        "caption": "The image shows a street view of a restaurant with a patio, located in a mountainous area. The restaurant has a large patio with tables and chairs, and it is situated next to a building.",
        "label": 5
    },
    "33738244500.jpg": {
        "caption": "The image shows a large, white village or town situated on a hillside. The town is surrounded by greenery, and it appears to be a quaint and charming place.",
        "label": 5
    },
    "2271035051.jpg": {
        "caption": "The image shows a row of chimneys on the roofs of houses, with a mountain in the background.",
        "label": 5
    },
    "276306830.jpg": {
        "caption": "The image shows a white tower or chimney, possibly a part of a building, with a blue sky in the background.",
        "label": 5
    },
    "4203318214.jpg": {
        "caption": "The image shows a foggy mountain landscape with a couple of white towers or lighthouses. The towers are located on a hill, and the foggy conditions create a somewhat mysterious atmosphere.",
        "label": 5
    },
    "7502225488.jpg": {
        "caption": "The image shows a small white building, possibly a hut or a shelter, located on a hillside or mountain. The building is situated in a scenic outdoor setting, surrounded by trees and mountains.",
        "label": 5
    },
    "15442971283.jpg": {
        "caption": "The image shows a beautiful view of a town with a mountain in the background. The town is surrounded by a white wall, and there are several chimneys on the roofs of the buildings. The scene is set against a blue sky, creating a picturesque and serene atmosphere.",
        "label": 5
    },
    "14786114596.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a black iron fence on one side. The alleyway is lined with buildings and has a black iron fence on one side.",
        "label": 5
    },
    "14112731790.jpg": {
        "caption": "The image shows two large, white, and mossy stone structures, which appear to be mushroom-shaped or have a mushroom-like appearance. These structures are located in a grassy area, possibly in a rural or natural setting.",
        "label": 5
    },
    "8307174827.jpg": {
        "caption": "The image shows a man with curly hair, a beard, and a mustache, who is wearing a blue jacket. He is standing on a street, possibly in a foreign country, and appears to be looking at the camera.",
        "label": 5
    },
    "352068515.jpg": {
        "caption": "The image shows a white building with a balcony and a flower box on the roof. The building is located in a mountainous area, and there are potted plants on the balcony.",
        "label": 5
    },
    "2378055917.jpg": {
        "caption": "The image shows a woman walking down a stone staircase, possibly in a narrow alley or a stone building.",
        "label": 5
    },
    "13929425832.jpg": {
        "caption": "The image shows a house with a garden on its roof, surrounded by a fence. The house is located in a mountainous area, and there is a mountain visible in the background.",
        "label": 5
    },
    "20761111853.jpg": {
        "caption": "The image shows a group of people, including a family, standing on a sidewalk near a building. They are posing for a picture, possibly in front of a city building or a tourist attraction.",
        "label": 5
    },
    "8850450167.jpg": {
        "caption": "The image shows a stone wall with green plants growing on it. The wall is part of a stone building, and the plants are climbing up the wall, adding a touch of nature to the urban setting.",
        "label": 5
    },
    "13702059565.jpg": {
        "caption": "The image shows two tall, white, stone towers or chimneys, standing next to each other on a hill.",
        "label": 5
    },
    "8489534403.jpg": {
        "caption": "The image shows a narrow alleyway between two buildings, with a streetlight on the side of one of the buildings. The alleyway is lined with buildings, and there is a car parked on the side of the street.",
        "label": 5
    },
    "25050122871.jpg": {
        "caption": "The image shows a busy street scene with a man standing on the sidewalk, wearing sunglasses and a jacket. The street is filled with cars, and there is a truck parked nearby. The man appears to be waiting for someone or something, possibly a ride or a friend. The overall atmosphere of the scene suggests a bustling urban environment.",
        "label": 5
    },
    "14084751684.jpg": {
        "caption": "The image shows a beautiful mountainous area with a town situated at the base of the mountain. The town is surrounded by green hills and mountains, creating a picturesque landscape.",
        "label": 5
    },
    "peneda_1_305170_1476178885918212102_image_FHxw3TyXIAgQxk6.jpg": {
        "caption": "The image shows a close-up view of a plate of food, which includes a variety of meat and vegetables. The plate is placed on a dining table.",
        "label": 2
    },
    "26764384083.jpg": {
        "caption": "The image shows two women sitting at a dining table, enjoying a meal together. They are surrounded by various food items and utensils, such as plates, cups, a fork, a knife, and a spoon. The women are smiling, indicating a pleasant atmosphere during their meal.",
        "label": 2
    },
    "5497716132.jpg": {
        "caption": "The image shows a plate of food, which includes a bowl of soup, a sandwich, and a glass of beer. The food is placed on a dining table.",
        "label": 2
    },
    "aiguestortes_NA_1619_28872141275__b.jpg": {
        "caption": "The image shows a menu, which is a list of food and beverage items offered by a restaurant. The menu is displayed in a booklet or a menu book, and it features a variety of dishes and drinks.",
        "label": 2
    },
    "4324272833.jpg": {
        "caption": "The image shows a hanging display of various types of cured meats, such as prosciutto and salami. These meats are hanging from strings, creating an appealing and organized presentation.",
        "label": 2
    },
    "granada_NA_1569_28251972920__b.jpg": {
        "caption": "The image shows a table filled with plates of food, including a variety of vegetables and salads. There are also utensils, such as forks and spoons, placed on the table.",
        "label": 2
    },
    "snev_NA_1507_52920446082__b.jpg": {
        "caption": "The image shows a plate of food, which includes a piece of meat, potatoes, and a sauce. The food is presented on a white plate.",
        "label": 2
    },
    "granada_NA_1568_22120873236__b.jpg": {
        "caption": "The image shows a plate of food, which includes a stack of sliced avocado, a slice of pineapple, and a slice of cantaloupe. The plate is placed on a dining table.",
        "label": 2
    },
    "picos_1_320358_1037703994536329216_image_DmaqRE8XgAAttfk.jpg": {
        "caption": "The image shows a table with a plate of food, a glass of beer, and a bottle of wine. There is also a spoon on the table.",
        "label": 2
    },
    "snev_NA_1508_52676843612__b.jpg": {
        "caption": "The image shows a young boy sitting at a table, holding a knife and fork in his hands. He is in the process of cutting food, possibly a piece of meat, with the knife.",
        "label": 2
    },
    "peneda_1_343086_768491826265333760_image_Cqo7IEwXgAA2wX-.jpg": {
        "caption": "The image shows a slice of cheesecake on a plate, with a spoon resting on top of it. The cheesecake appears to be a dessert, and the plate is placed on a dining table.",
        "label": 2
    },
    "6859691522.jpg": {
        "caption": "The image shows a store or market with a large display of hanging meat, specifically hams.",
        "label": 2
    },
    "aiguestortes_NA_1619_43105383404__b.jpg": {
        "caption": "The image shows a plate of food, which includes rice, meat, and vegetables. The plate is placed on a dining table, and there is a bowl of soup next to it.",
        "label": 2
    },
    "guadarrama_1_318396_1437090712651239429_image_E_GSYYTXoAMUVdX.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of items such as meat, bread, and a beer. The plate is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1513_31020438156__b.jpg": {
        "caption": "The image shows two cooked shrimp on a white plate, placed on a wooden table.",
        "label": 2
    },
    "aiguestortes_NA_3863_51439981880__b.jpg": {
        "caption": "The image shows a bowl of soup, which is filled with noodles, vegetables, and possibly meat. The soup is served in a green bowl, and it appears to be a delicious and healthy meal.",
        "label": 2
    },
    "granada_NA_1569_37341034476__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of ingredients such as vegetables, meat, and possibly some sauces. The plate is placed on a dining table.",
        "label": 2
    },
    "peneda_1_363802_1540744017377239042_image_FWHShKdXwAE_Uni.jpg": {
        "caption": "The image shows a plate filled with a variety of food items, including fried potatoes, fried vegetables, and fried bread. The plate is placed on a dining table.",
        "label": 2
    },
    "guadarrama_NA_2057_26369351540__b.jpg": {
        "caption": "The image shows a cup of coffee or tea, with a spoon resting inside the cup. The cup is placed on a dining table.",
        "label": 2
    },
    "picos_1_489325_1278460690571943938_image_Eb4BNEWXQAAH-TV.jpg": {
        "caption": "The image shows a plate of food, which appears to be a meat dish, accompanied by a spoon. The plate is placed on a dining table.",
        "label": 2
    },
    "peneda_1_373660_1566067862401417216_image_FbvKYRVXEAESwBX.jpg": {
        "caption": "The image shows a plate of food, which includes fish, tomatoes, and carrots. The plate is placed on a dining table.",
        "label": 2
    },
    "picos_1_423996_870627856593846273_image_DBUXa6aW0AU3AZ8.jpg": {
        "caption": "The image shows a close-up of a dish filled with a variety of foods, including beans, meat, and a glass of wine. The dish appears to be a hearty meal, and the foods are presented in a visually appealing manner.",
        "label": 2
    },
    "guadarrama_NA_1935_51980168770__b.jpg": {
        "caption": "The image shows a piece of bread with a slice of meat on top, possibly ham. The meat is placed on the bread, and the overall presentation looks appetizing.",
        "label": 2
    },
    "granada_NA_1569_17217832330__b.jpg": {
        "caption": "The image shows a table filled with a variety of foods, including fruits, desserts, and other dishes. The table is set up for a buffet-style meal, and it appears to be a wedding reception.",
        "label": 2
    },
    "granada_NA_1513_30922970222__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of seafood dishes, such as squid and octopus. The plate is placed on a wooden table.",
        "label": 2
    },
    "granada_NA_1460_48361690652__b.jpg": {
        "caption": "The image shows a display case filled with various types of candy and desserts. The candy is colorful and displayed in a visually appealing manner.",
        "label": 2
    },
    "8611606630.jpg": {
        "caption": "The image shows a store or market with a large display of hanging meat, specifically hams.",
        "label": 2
    },
    "granada_NA_1515_34525785270__b.jpg": {
        "caption": "The image shows a plate of food, which includes bread, tomatoes, and possibly some other food items. There is also a glass of wine on the table.",
        "label": 2
    },
    "picos_1_489325_1278460690571943938_image_Eb4BNEbXkAEvDIU.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of food items such as bread, meat, and vegetables. The plate is placed on a table.",
        "label": 2
    },
    "guadarrama_NA_1935_51980168620__b.jpg": {
        "caption": "The image shows a plate of food, which includes meat, potatoes, and gravy. The plate is placed on a dining table.",
        "label": 2
    },
    "peneda_1_343086_1439580068624453634_image_E_pqcDFXIAMHcBp.jpg": {
        "caption": "The image shows a plate filled with a variety of food items, including meat, potatoes, and vegetables. The plate is placed on a dining table.",
        "label": 2
    },
    "aiguestortes_NA_1619_28257029093__b.jpg": {
        "caption": "The image shows a plate of food, which includes french fries, onion rings, and a lemon wedge. The plate is placed on a dining table.",
        "label": 2
    },
    "aiguestortes_NA_1619_30202309588__b.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of vegetables, pasta, and tomatoes. The plate is placed on a table, and there are also some flowers nearby.",
        "label": 2
    },
    "granada_NA_1513_31018283416__b.jpg": {
        "caption": "The image shows a man preparing food, specifically shrimp, in a kitchen. He is standing at a counter, cutting the shrimp on a plate.",
        "label": 2
    },
    "4176681207.jpg": {
        "caption": "The image shows a group of people gathered around a large pot, which is filled with food. They are standing in a line, and some of them are wearing hats. The people appear to be enjoying a meal together, possibly at an outdoor event or a communal gathering.",
        "label": 2
    },
    "snev_NA_1508_52677851978__b.jpg": {
        "caption": "The image shows a close-up view of a dish, which appears to be a bowl of food, possibly a stew or a sauce. The dish is filled with a red substance, and it is placed on a table.",
        "label": 2
    },
    "picos_1_500651_1073493848964456448_image_DuXQ6COWsAADlxw.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of food items such as meat, vegetables, and bread. The plate is placed on a dining table.",
        "label": 2
    },
    "granada_NA_1569_17148388616__b.jpg": {
        "caption": "The image shows a plate full of various seafood dishes, including shrimp, scallops, and other seafood items. The plate is placed on a table.",
        "label": 2
    },
    "peneda_1_343086_1042801767480786944_image_DnjGokXXgAMsU4D.jpg": {
        "caption": "The image shows a close-up view of a sandwich, with a fork sticking out of it. The sandwich appears to be a meat and cheese sandwich.",
        "label": 2
    },
    "guadarrama_NA_2057_24520796232__b.jpg": {
        "caption": "The image shows a close-up of a dish containing a seafood dish, possibly a sea urchin, with orange and red colors. The dish is placed on a plate, and the focus is on the seafood itself.",
        "label": 2
    },
    "granada_NA_1567_48044793063__b.jpg": {
        "caption": "The image shows a plate of food, which includes meat, potatoes, and possibly some vegetables. The plate is placed on a dining table, and a fork is resting on the plate.",
        "label": 2
    },
    "granada_NA_1515_32112058180__b.jpg": {
        "caption": "The image shows a woman sitting at a table, eating a pastry or a piece of food. She is wearing a green shirt and has a ring on her finger.",
        "label": 2
    },
    "granada_NA_1460_50870753176__b.jpg": {
        "caption": "The image shows a slice of quiche on a plate, with a portion of the quiche missing.",
        "label": 2
    },
    "peneda_1_343086_786652939976859648_image_CurAp0LWAAAn2nY.jpg": {
        "caption": "The image shows a slice of cake on a plate, with a spoon resting on top of it. The cake appears to be a dessert, and the plate is placed on a dining table.",
        "label": 2
    },
    "ordesa_3_135310_1581328062914129920_image_FfIBfOTWIAIRVyk.jpg": {
        "caption": "The image shows a plate of pastries, specifically a stack of donuts, sitting on a wooden table.",
        "label": 2
    },
    "picos_1_326635_1517200565461266435_image_FQ4t3boXwAI-w_y.jpg": {
        "caption": "The image shows a plate of food, which includes a variety of meat and a red pepper. The plate is placed on a dining table.",
        "label": 2
    },
    "guadarrama_NA_1854_33386717331__b.jpg": {
        "caption": "The image shows a close-up view of a glass filled with a blue beverage, which appears to be a blue cocktail. The glass is filled with bubbles, and there is a slice of lemon in the drink.",
        "label": 2
    },
    "guadarrama_NA_1935_51979890584__b.jpg": {
        "caption": "The image shows a cup of coffee or a hot beverage, with a spoon resting inside the cup. The cup is filled with a brown liquid, which could be coffee or another hot beverage.",
        "label": 2
    },
    "aiguestortes_NA_2527_32262604975__b.jpg": {
        "caption": "The image shows a large, old church with a tall clock tower. The church has a stone exterior, and the clock tower is located on the side of the building. The scene is set during sunset, which adds a warm and serene atmosphere to the image.",
        "label": 0
    },
    "5054297177.jpg": {
        "caption": "The image shows a wall filled with various artworks, including pictures, mirrors, and possibly other decorative items. The wall is covered with a diverse collection of art pieces, creating an interesting and visually appealing display.",
        "label": 0
    },
    "2915659429.jpg": {
        "caption": "The image shows a long row of stone basins or water basins, which are lined up next to each other.",
        "label": 0
    },
    "guadarrama_NA_1124_29118201421__b.jpg": {
        "caption": "The image shows a church with a clock tower, a bell tower, and a steeple. The church is located on a street corner, and there is a clock on the side of the building.",
        "label": 0
    },
    "guadarrama_NA_1935_35308775206__b.jpg": {
        "caption": "The image shows a statue of two children, possibly angels, playing with a toy. The statue is located in a city, and it appears to be a popular spot for people to take pictures.",
        "label": 0
    },
    "aiguestortes_NA_3975_51988547548__b.jpg": {
        "caption": "The image shows a stone building with a clock tower, which has a clock on each of its sides. The building also features a stone archway and a stone window.",
        "label": 0
    },
    "3038539021.jpg": {
        "caption": "The image shows a church with a red roof, surrounded by trees and mountains. The church is located in a valley, and the surrounding landscape includes a mountain range.",
        "label": 0
    },
    "7588068292.jpg": {
        "caption": "The image shows a display of various clothing items, including dresses and shirts, hanging on a wall. The display is set up in a way that allows customers to easily view the available clothing options.",
        "label": 0
    },
    "guadarrama_NA_1848_48864312458__b.jpg": {
        "caption": "The image shows a large stone monument or statue, possibly a church steeple, with two statues of men on top of it. The statue is located in a park, and there are trees in the background.",
        "label": 0
    },
    "3739894816.jpg": {
        "caption": "The image shows a white building with a dome on top, which appears to be a church or a mosque. The building is situated on a hill, overlooking a valley.",
        "label": 0
    },
    "granada_NA_1515_33934289590__b.jpg": {
        "caption": "The image shows a large, ornate building with a clock tower and a steeple. The building has a distinctive architectural style, and it is situated next to a forest.",
        "label": 0
    },
    "guadarrama_NA_1929_29908421844__b.jpg": {
        "caption": "The image shows a large cross on top of a hill, with a view of the surrounding landscape.",
        "label": 0
    },
    "2922086549.jpg": {
        "caption": "The image shows a waterfall or a water spout, with water pouring out of it. The water is flowing down a stone wall, creating a visually striking scene.",
        "label": 0
    },
    "33971254391.jpg": {
        "caption": "The image shows a group of people, specifically three men, sitting on a rock or a stone structure. They are posing for a picture, possibly on a mountain or a hill.",
        "label": 0
    },
    "aiguestortes_NA_1699_31570171480__b.jpg": {
        "caption": "The image shows a church interior, featuring a large stone archway, a stone altar, and a stone wall. The church has a large stone archway, which adds to the grandeur of the space.",
        "label": 0
    },
    "53239733758.jpg": {
        "caption": "The image shows a clock tower with a cross on top, located next to a castle-like structure. The clock tower is part of a church, and the scene is set against a blue sky.",
        "label": 0
    },
    "guadarrama_NA_1976_24235274638__b.jpg": {
        "caption": "The image shows a large stone archway or gate, which is part of a stone building. The archway is adorned with statues, and there are two statues on the top of the archway. The scene also includes a mountain in the background.",
        "label": 0
    },
    "1277142094398840832.jpg": {
        "caption": "The image shows a statue of a woman, possibly a religious figure, wearing a crown and a red robe. The statue is wearing a crown and a red robe, and it appears to be a religious figure.",
        "label": 0
    },
    "guadarrama_NA_1936_48448089982__b.jpg": {
        "caption": "The image shows a large, ornate church with a beautifully decorated interior. The church features a large, colorful mural on the wall, and there is a group of people gathered in the church.",
        "label": 0
    },
    "3713999455.jpg": {
        "caption": "The image shows the inside of a large, ornate church with a high ceiling and a large arch. The church has a long aisle and is filled with pews, providing a spacious and serene atmosphere for worship.",
        "label": 0
    },
    "4901087398.jpg": {
        "caption": "The image shows a colorful blanket hanging on a wooden post or a wooden rack. The blanket is made of yarn and has a multicolored pattern.",
        "label": 0
    },
    "1162978702214516736.jpg": {
        "caption": "The image shows a large, old church with a clock tower and two steeples. It is located in a mountainous area, and there are several people walking around the church.",
        "label": 0
    },
    "16535577693.jpg": {
        "caption": "The image shows a row of colorful rugs hanging on a wall, possibly in a store or a public space.",
        "label": 0
    },
    "guadarrama_NA_1935_20526936690__b.jpg": {
        "caption": "The image shows a large building with a clock tower, which is situated under a blue sky. The building has a prominent clock tower, and it appears to be a church or a similar type of structure.",
        "label": 0
    },
    "aiguestortes_NA_2454_20067987089__b.jpg": {
        "caption": "The image shows a church with a large steeple, situated on a hillside. The church is surrounded by a lush green hillside, and there are cows grazing nearby. The scene also includes a mountain in the background, adding to the picturesque landscape.",
        "label": 0
    },
    "guadarrama_NA_2055_21224615179__b.jpg": {
        "caption": "The image shows a group of women dressed in traditional clothing, possibly dancing or performing in a parade. They are wearing colorful outfits, and some of them are holding instruments.",
        "label": 0
    },
    "28737082600.jpg": {
        "caption": "The image shows a large brick tower with a clock on its side, towering over a city. The tower is situated next to a building, and there is a tree in front of it.",
        "label": 0
    },
    "aiguestortes_NA_3975_37960765414__b.jpg": {
        "caption": "The image shows a large brick building with a stone clock tower, which has a cross on top. The building is situated next to a mountain, and the sky is visible in the background.",
        "label": 0
    },
    "8318142634.jpg": {
        "caption": "The image shows a collection of colorful wooden chairs, which are displayed in a row.",
        "label": 0
    },
    "snev_NA_8801_53429464755__b.jpg": {
        "caption": "The image shows a long, narrow room with arched doorways and a brick wall. The room appears to be a tunnel or a passageway, and it is filled with water.",
        "label": 0
    },
    "guadarrama_NA_1935_49027953807__b.jpg": {
        "caption": "The image shows a large, ornate monument or a tall, white building with a clock tower on top. The building has a clock on its side, and there are statues on the top of the structure.",
        "label": 0
    },
    "26621116673.jpg": {
        "caption": "The image shows a group of women wearing red and white polka dot dresses, standing next to each other.",
        "label": 0
    },
    "aiguestortes_NA_1699_17013527431__b.jpg": {
        "caption": "The image shows a church with a large clock tower, a stone building, and a stone clock tower. The church is located next to a mountain.",
        "label": 0
    },
    "aiguestortes_NA_2580_31872054926__b.jpg": {
        "caption": "The image shows a clock tower, which is part of a building with a clock on it. The clock tower is located next to a church, and the building has a large clock on its side.",
        "label": 0
    },
    "granada_NA_1568_17732287191__b.jpg": {
        "caption": "The image shows a beautiful church with a cross on top, surrounded by a lush green forest. The church is located next to a forest, and there is a tree with purple flowers in front of it. The scene is serene and picturesque, showcasing the harmony between nature and religious architecture.",
        "label": 0
    },
    "10805304366.jpg": {
        "caption": "The image shows an older man and woman sitting together on a bench, possibly in a park or a similar outdoor setting.",
        "label": 0
    },
    "granada_NA_1568_17294444448__b.jpg": {
        "caption": "The image shows the inside of a large building, possibly a church or a historical building, with a high ceiling and a dome. The building has a stone or brick-like appearance, giving it an old and majestic look.",
        "label": 0
    },
    "guadarrama_NA_1976_24165726928__b.jpg": {
        "caption": "The image shows a cityscape with a large, old building, possibly a church, and a castle-like structure. The scene is set against a beautiful sunset, creating a picturesque atmosphere.",
        "label": 0
    },
    "51012767325.jpg": {
        "caption": "The image shows a person standing on top of a large, old stone tower or castle. The person is looking out over the city, enjoying the view from the tower.",
        "label": 0
    },
    "15823750999.jpg": {
        "caption": "The image shows a man standing on a bridge or a walkway, overlooking a beautiful mountain view. The scene is set against a backdrop of mountains, creating a picturesque and serene atmosphere.",
        "label": 0
    },
    "2431316017.jpg": {
        "caption": "The image shows a building with a cross on top of it, which is a church. The building is undergoing a renovation process, as indicated by the white paint covering the building.",
        "label": 0
    },
    "24481343011.jpg": {
        "caption": "The image shows a variety of colorful blankets and rugs hanging on a wall, possibly in a market or a store.",
        "label": 0
    },
    "guadarrama_NA_2055_21223806790__b.jpg": {
        "caption": "The image shows a group of people, likely a dance troupe, dressed in colorful costumes and performing in a church. They are holding a statue or a large decorative piece, possibly a statue of a woman. The scene takes place in a church, with the performers standing in front of the statue.",
        "label": 0
    },
    "aiguestortes_NA_2170_16999978429__b.jpg": {
        "caption": "The image shows a large, old stone building with a clock tower. The building has a brick-like appearance, and it is situated on a hill.",
        "label": 0
    },
    "aiguestortes_NA_2580_50218010016__b.jpg": {
        "caption": "The image shows a large, ornate church with a high vaulted ceiling. The church features a large, open area with a stone floor, and it is adorned with paintings and decorations.",
        "label": 0
    },
    "guadarrama_NA_1935_16796227519__b.jpg": {
        "caption": "The image shows a painting or mural of a man in a black hat, possibly a portrait of a man in a black hat. The man is standing next to a group of people, and he is holding a baby.",
        "label": 0
    },
    "aiguestortes_NA_2098_29246924953__b.jpg": {
        "caption": "The image shows a church with a bell tower, which has a cross on top. The church is made of stone, giving it a historical and majestic appearance.",
        "label": 0
    },
    "aiguestortes_NA_2527_19286247890__b.jpg": {
        "caption": "The image shows a large brick church with a tall clock tower, which is part of the church's architecture. The church is located in a mountainous area, and the clock tower stands tall above the surrounding landscape.",
        "label": 0
    }
}